/*[]----------------------------------------------------------------------------------------------------------[]*/
/*|	ﾛｯｸ装置通信制御部																						   |*/
/*[]----------------------------------------------------------------------------------------------------------[]*/
/*|		lkcomtask.c																							   |*/
/*[]----------------------------------------------------------------------------------------------------------[]*/
/*| Author      :																							   |*/
/*| Date        : 2005-02-01																				   |*/
/*| Update      :																							   |*/
/*[]------------------------------------------------------------------------- Copyright(C) 2005 AMANO Corp.---[]*/
#include	<string.h>															/*								*/
#include	<stdio.h>															/*								*/
#include	<stdlib.h>															/*								*/
#include	"system.h"															/*								*/
#include	"Message.h"															/*								*/
																				/*								*/
#include	"LKcom.h"															/*								*/
#include	"LKmain.h"															/*								*/
#include	"common.h"
#include	"LCM.h"
#include	"toS.h"
#include	"IFM.h"
#include	"flp_def.h"

																				/*								*/
uchar	LK_Init;																/*								*/
																				/*								*/
/*[]----------------------------------------------------------------------------------------------------------[]*/
/*| ﾛｯｸ装置通信制御処理																						   |*/
/*[]----------------------------------------------------------------------------------------------------------[]*/
/*| MODULE NAME  : lkcomtask()																				   |*/
/*| PARAMETER    : void																						   |*/
/*| RETURN VALUE : void																						   |*/
/*[]----------------------------------------------------------------------------------------------------------[]*/
/*| Author       :																							   |*/
/*| Date         : 2005-02-01																				   |*/
/*| Update       :																							   |*/
/*[]------------------------------------------------------------------------- Copyright(C) 2005 AMANO Corp.---[]*/
void	lkcomtask( void )														/*								*/
{																				/*								*/
	for( ; ; ) {																/*								*/
																				/*								*/
		taskchg( IDLETSKNO );													/* Change task to idletask		*/
																				/*								*/
		if (LKcom_f_TaskStop == 1) {											/* ﾛｯｸ装置通信ﾀｽｸの処理をしない	*/
			continue;															/*								*/
		}																		/*								*/
		if( LKcom_InitFlg == 0 )												/* 初期化未終了					*/
		{																		/*								*/
			LKcom_Init();														/* 初期化						*/
			LKcom_InitFlg = 1;													/* 初期化済みｾｯﾄ				*/
		}																		/*								*/
		else																	/*								*/
		{																		/*								*/
			LCM_main();
			toScomdr_Main();													/* 子機からのSCI受信ドライバ呼び出し */
			toScom_Main();														/* 子機からの応答解析 */
		}																		/*								*/
// fcmain()の中でログDBにアクセスしたときアイドルタスクからアイドルタスクへタスクチェンジしてしまい動作不能のなるため
		if (SysTimeAdj.state < _T_BUSY) {										/*								*/
			// 時刻調整中はフラップ処理しない									/*								*/
			fcmain();															// Call flap manager
		}																		/*								*/
	}																			/*								*/
}																				/*								*/
																				/*------------------------------*/
