/*[]----------------------------------------------------------------------------------------------------------[]*/
/*|		IF盤通信ﾀｽｸ																							   |*/
/*|																											   |*/
/*[]----------------------------------------------------------------------------------------------------------[]*/
/*|	FILE NAME	:	lkcom.c																					   |*/
/*|																											   |*/
/*[]----------------------------------------------------------------------------------------------------------[]*/
/*| ・IF盤との通信及びMAINﾀｽｸとのｲﾝﾀｰﾌｪｰｽ																	   |*/
/*|																											   |*/
/*[]------------------------------------------------------------------ Copyright(C) 2005 AMANO Corp.----------[]*/
#include	<string.h>															/*								*/
#include	<stdlib.h>															/*								*/
																				/*								*/
#include	"iodefine.h"														/*								*/
#include	"system.h"															/*								*/
#include	"Message.h"															/*								*/
#include	"flp_def.h"															/*								*/
#include	"prm_tbl.h"															/*								*/
#include	"LKcom.h"															/*								*/
#include	"LKmain.h"															/*								*/
#include	"mem_def.h"
#include	"rkn_def.h"
#include	"rkn_cal.h"
#include	"ope_def.h"
#include	"common.h"
#include	"LCM.h"
#include	"toS.h"
#include	"IFM.h"

void		LKcom_Init( void );													/*								*/
																				/*								*/
ushort		LKcom_SndDtDec( void );												/*								*/
uchar		LKcom_RcvDataSave(uchar *data, ushort len );
uchar		LKcom_RcvDataDel( void );											/*								*/
																				/*								*/
void		LKcom_RcvBuffReset( void );											/* 受信ﾃﾞｰﾀ格納ﾊﾞｯﾌｧﾘｾｯﾄ		*/
void		LKcom_PassBreak( void );											/*								*/
																				/*								*/
																				/*								*/
/*[]----------------------------------------------------------------------------------------------------------[]*/
/*|	IF盤通信初期化																							   |*/
/*[]----------------------------------------------------------------------------------------------------------[]*/
/*| MODULE NAME	: LKcom_Init()																				   |*/
/*| PARAMETER	: par1	: 																					   |*/
/*|				: par2	: 																					   |*/
/*| RETURN VALUE: ret	: 設定値																			   |*/
/*| 			: 		: -1 = 引数ｴﾗｰ																		   |*/
/*[]----------------------------------------------------------------------------------------------------------[]*/
/*| Author		: A.Iiizumi																			   |*/
/*| Date		: 2011-11-10																				   |*/
/*| Update		:																							   |*/
/*[]----------------------------------------------------------------------------------------------------------[]*/
/*|																											   |*/
/*[]---------------------------------------------------------------------- Copyright(C) 2005 AMANO Corp.------[]*/
void	LKcom_Init( void )														/*								*/
{																				/*								*/
																	/*								*/
																				/*								*/
	CP_IF_RTS = 0;
																				/*								*/
	LKcom_RcvBuffReset();// 受信ﾊﾞｯﾌｧ初期化
																				/*								*/
	LKcom_f_SndReq = 0;															/* POL/SEL送信ﾘｸｴｽﾄ				*/
																				/*								*/
	LKcomLineCtrl.PktSeqNo = 1;													/* ﾊﾟｹｯﾄｼｰｹﾝｼｬﾙNo.ﾘｾｯﾄ			*/
																				/*								*/
	LKcomLineCtrl.TnoNow = 1;													/* 現POLﾀｰﾐﾅﾙNo.ﾘｾｯﾄ			*/
																				/*								*/
	LKcomLineCtrl.MentFlg = 0;													/* ﾒﾝﾃﾅﾝｽﾌﾗｸﾞｸﾘｱ				*/
																				/*								*/
	memset( &LKcomTerm.CtrlInfo, 0x00, sizeof(t_LKcomQueCtrl) );				/*								*/
	LK_Init = 1;																/*								*/
																				/*								*/
	LKcom_SetLockMaker();														/* ｲﾆｼｬﾙ						*/
	LKcom_AllInfoReq(_MTYPE_LOCK);
	LKcom_InitAccessTarminalType();												// 装置種別を反映
	LCM_init();
	/* 通常運用へ移行する */
	toS_init();						/* 通信に必要な初期化*/
	PAYcom_InitDataSave();
}																				/*								*/

/*[]----------------------------------------------------------------------------------------------------------[]*/
/*|	受信ﾃﾞｰﾀ格納ﾊﾞｯﾌｧﾘｾｯﾄ																					   |*/
/*[]----------------------------------------------------------------------------------------------------------[]*/
/*| MODULE NAME	: LKcom_RcvBuffReset()																		   |*/
/*| PARAMETER	: Non	: 																					   |*/
/*| RETURN VALUE: 		: 設定値																			   |*/
/*| 			: 		:																					   |*/
/*[]----------------------------------------------------------------------------------------------------------[]*/
/*| Author		: K.Akiba(AMANO)																			   |*/
/*| Date		: 2005-06-15																				   |*/
/*| Update		:																							   |*/
/*[]----------------------------------------------------------------------------------------------------------[]*/
/*|																											   |*/
/*[]---------------------------------------------------------------------- Copyright(C) 2005 AMANO Corp.------[]*/
void	LKcom_RcvBuffReset( void )												/*								*/
{																				/*								*/
	LKcom_RcvData.dcnt = 0;														/* ﾃﾞｰﾀ格納件数ｾｯﾄ				*/
	LKcom_RcvData.all_siz = 0;													/* 総ﾃﾞｰﾀ格納ﾊﾞｲﾄ数ｾｯﾄ			*/
	LKcom_RcvData.zan_siz = LK_RCV_BUF_SIZE;									/* 空きｴﾘｱﾊﾞｲﾄ数ｾｯﾄ				*/
	return;																		/*								*/
}																				/*								*/
																				/*								*/
/*[]----------------------------------------------------------------------------------------------------------[]*/
/*|	送信済みﾃﾞｰﾀ消去																						   |*/
/*[]----------------------------------------------------------------------------------------------------------[]*/
/*| MODULE NAME	: LKcom_SndDtDec(void)																		   |*/
/*| PARAMETER	: Non	: 																					   |*/
/*| RETURN VALUE: ret	: 送信ﾃﾞｰﾀｷｭｰ管理ﾃｰﾌﾞﾙの件数														   |*/
/*| 			: 		: 																					   |*/
/*[]----------------------------------------------------------------------------------------------------------[]*/
/*| Author		: A.Iiizumi(AMANO)																			   |*/
/*| Date		: 2011-11-14																				   |*/
/*| Update		:																							   |*/
/*[]----------------------------------------------------------------------------------------------------------[]*/
/*|	・IF盤へ送信済みのﾃﾞｰﾀﾊﾟｹｯﾄを消去する																	   |*/
/*[]---------------------------------------------------------------------- Copyright(C) 2005 AMANO Corp.------[]*/
ushort	LKcom_SndDtDec( void )													/*								*/
{																				/*								*/
	ushort	ret=0xFFFF;
	++LKcomTerm.CtrlInfo.R_Index;
	if( LOCK_CTRL_BUFSIZE_MAX <= LKcomTerm.CtrlInfo.R_Index ){
		LKcomTerm.CtrlInfo.R_Index = 0;
	}
		--LKcomTerm.CtrlInfo.Count;
	ret = LKcomTerm.CtrlInfo.Count;
	return(ret);
}																				/* 								*/
																				/* 								*/
/*[]----------------------------------------------------------------------------------------------------------[]*/
/*|	受信ﾃﾞｰﾀﾊﾟｹｯﾄｾｰﾌﾞ																						   |*/
/*[]----------------------------------------------------------------------------------------------------------[]*/
/*| MODULE NAME	: LKcom_RcvDataSave()																		   |*/
/*| PARAMETER	: par1	: 受信したデータのバッファのポインタ(LKcomdr_RcvBufのポインタ)						   |*/
/*|				: par2	: 受信したデータのレングス															   |*/
/*| RETURN VALUE: ret	: 設定値																			   |*/
/*| 			: 		: -1 = 引数ｴﾗｰ																		   |*/
/*[]----------------------------------------------------------------------------------------------------------[]*/
/*| Author		: A.Iiizumi																					   |*/
/*| Date		: 2011-11-15																				   |*/
/*| Update		:																							   |*/
/*[]----------------------------------------------------------------------------------------------------------[]*/
/*|	・受信したﾃﾞｰﾀをｱﾌﾟﾘｹｰｼｮﾝへの受信ﾃﾞｰﾀﾊﾞｯﾌｧへ格納														   |*/
/*|     LKcomdr_RcvBufに格納されているﾃﾞｰﾀをｱﾌﾟﾘﾊﾞｯﾌｧLKcom_RcvDataへ格納する								   |*/
/*|     LKcomdr_RcvBufの先頭はデータ種別(ID4)から格納される。レングスもデータ種別から有効なデータの末尾まで	   |*/
/*|     ただし、シーケンシャルNo→端末Noとして扱っている。詳細はt_IFM_Queue参照のこと                          |*/
/*| 【構造体構成】LKcom_RcvData																				   |*/
/*|		ﾃﾞｰﾀｻｲｽﾞ	2 byte(2+1+ﾃﾞｰﾀ)																		   |*/
/*|		ﾃﾞｰﾀ		**** byte(ID4～CRCの手前)																   |*/
/*[]---------------------------------------------------------------------- Copyright(C) 2005 AMANO Corp.------[]*/
uchar	LKcom_RcvDataSave(
uchar	*data,																// 受信したデータのバッファのポインタ
ushort	len )																// データレングス
{
	ushort	dat_siz;
	union {
		uchar	uc[2];
		ushort	us;
	}u;

	dat_siz = len;															// 受信ﾃﾞｰﾀの格納すべきﾊﾞｲﾄ数を算出
	u.us = dat_siz + 2;														// サイズ2バイト＋データ
	if( LKcom_RcvData.zan_siz < u.us ){										
		return( 1 );														// ﾊﾞｯﾌｧFULLで格納不可NAK
	}

	LKcom_RcvData.data[LKcom_RcvData.all_siz] = u.uc[0];					// ﾃﾞｰﾀｻｲｽﾞ(上位1Byte)
	LKcom_RcvData.all_siz ++;												// ﾃﾞｰﾀ格納位置更新
	LKcom_RcvData.data[LKcom_RcvData.all_siz] = u.uc[1];					// ﾃﾞｰﾀｻｲｽﾞ(下位1Byte)
	LKcom_RcvData.all_siz ++;												// ﾃﾞｰﾀ格納位置更新

	memcpy( &LKcom_RcvData.data[LKcom_RcvData.all_siz], data, (size_t)dat_siz ); 
	LKcom_RcvData.dcnt ++;													// ﾃﾞｰﾀ格納件数ｶｳﾝﾄｱｯﾌﾟ	
	LKcom_RcvData.all_siz += dat_siz;										// ﾃﾞｰﾀ格納ﾊﾞｲﾄ数更新
	LKcom_RcvData.zan_siz -= u.us;											// 残りｻｲｽﾞ更新
	queset( FLPTCBNO, LK_DATAREC, 0, NULL );								// ﾃﾞｰﾀ受信
	return( 0 );
}
/*[]----------------------------------------------------------------------------------------------------------[]*/
/*|	受信ﾃﾞｰﾀﾊﾟｹｯﾄ消去（ｱﾌﾟﾘ）																				   |*/
/*[]----------------------------------------------------------------------------------------------------------[]*/
/*| MODULE NAME	: LKcom_RcvDataDec()																		   |*/
/*| PARAMETER	: par1	: 端末No.																			   |*/
/*|				: par2	: 制御ﾌﾗｸﾞ	0=ﾊﾞｯﾌｧ/																   |*/
/*|				: par3	: 転送ﾌﾞﾛｯｸ数(ENQの時のみ有効)														   |*/
/*| RETURN VALUE: ret	: 設定値																			   |*/
/*| 			: 		: -1 = 引数ｴﾗｰ																		   |*/
/*[]----------------------------------------------------------------------------------------------------------[]*/
/*| Author		: K.Akiba(AMANO)																			   |*/
/*| Date		: 2005-02-23																				   |*/
/*| Update		:																							   |*/
/*[]----------------------------------------------------------------------------------------------------------[]*/
/*|	・受信ﾃﾞｰﾀが格納されたｱﾌﾟﾘｹｰｼｮﾝ用のﾊﾞｯﾌｧから1件分のﾃﾞｰﾀを消去する										   |*/
/*[]---------------------------------------------------------------------- Copyright(C) 2005 AMANO Corp.------[]*/
uchar	LKcom_RcvDataDel( void )												/*								*/
{																				/*								*/
	union {																		/*								*/
		uchar	uc[2];															/*								*/
		ushort	us;																/*								*/
	}u;																			/*								*/
																				/*								*/
	u.uc[0] = LKcom_RcvData.data[0];											/* ﾃﾞｰﾀｻｲｽﾞ(上位1Byte)			*/
	u.uc[1] = LKcom_RcvData.data[1];											/* ﾃﾞｰﾀｻｲｽﾞ(下位1Byte)			*/
																				/*								*/
	LKcom_RcvData.dcnt --;														/* ﾃﾞｰﾀ格納件数ｶｳﾝﾄｱｯﾌﾟ			*/
	LKcom_RcvData.all_siz -= u.us;												/* ﾃﾞｰﾀ格納ﾊﾞｲﾄ数更新			*/
	LKcom_RcvData.zan_siz += u.us;												/* ﾃﾞｰﾀ格納ﾊﾞｯﾌｧ空き更新		*/
																				/*								*/
	if (LKcom_RcvData.all_siz != 0) {
		memcpy(&LKcom_RcvData.data[0], &LKcom_RcvData.data[u.us], (size_t)LKcom_RcvData.all_siz);		/* 制御文字の取得				*/
	}
	return( 0 );																/*								*/
}																				/*								*/
																				/*								*/
/*[]----------------------------------------------------------------------------------------------------------[]*/
/*|             LKcom_PassBreak()																			   |*/
/*[]----------------------------------------------------------------------------------------------------------[]*/
/*|		精算機起動後（電源OFF→ON）ﾊﾟｽﾜｰﾄﾞ破壊時のﾊﾞｯﾌｧｸﾘｱ													   |*/
/*[]----------------------------------------------------------------------------------------------------------[]*/
/*| Author      :  K.Akiba																					   |*/
/*| Date        :  2005-06-15																				   |*/
/*| Update      :																							   |*/
/*[]------------------------------------------------------------------------- Copyright(C) 2003 AMANO Corp.---[]*/
void	LKcom_PassBreak( void )													/*								*/
{																				/*								*/
	memset( &LKcomTerm, 0x00, sizeof(t_LKcomTerm));								/*								*/
	memset(IFM_FlapSensor, -1, sizeof(IFM_FlapSensor));
	memset(&IFM_LockAction, 0, sizeof(IFM_LockAction));
}																				/*								*/

