/*[]----------------------------------------------------------------------[]*/
/*|		ロック管理タスク 外部参照(領域)宣言								   |*/
/*|			・ここには、新I/F盤（親機）内の「ロック装置管理」タスクが	   |*/
/*|			  使用する領域の外部参照宣言します。						   |*/
/*|																		   |*/
/*[]----------------------------------------------------------------------[]*/
/*| Author      :  K.Akiba		                                           |*/
/*| Date        :  2003-01-27                                              |*/
/*| Update      :                                                          |*/
/*[]------------------------------------- Copyright(C) 2005 AMANO Corp.---[]*/
#ifndef _LCM_DATA_H_
#define _LCM_DATA_H_

#include	"IF.h"

/*----------------------------------*/
/*		area style define			*/
/*----------------------------------*/


/*----------------------------------*/
/*			value define			*/
/*----------------------------------*/


/*==================================*/
/*		InRAM area define			*/
/*==================================*/


/*----------------------------------*/
/*			LCMtimr.c				*/
/*----------------------------------*/
extern	ushort	LCMtim_Tx10ms_Action[IF_SLAVE_MAX][IFS_ROOM_MAX];				/* 10msec単位：動作タイマー(故障検知) */
extern	ushort	LCMtim_Tx1sec_Retry[IF_SLAVE_MAX][IFS_ROOM_MAX];				/*   1sec単位：故障時リトライ間隔 */
extern	ushort	LCMtim_Tx1sec_Wait;					/*   1sec単位：以下に使用する */
													/*				①バージョン要求に対する応答待ち */
													/*				②全ロック開/閉 */
													/*				③全/個別ロック開閉テスト */
extern	uchar	LCM_f_TmStart;						/* タイマー動作開始フラグ */
													/*		1=タイマー動作する（カウントする）*/
													/*		0=タイマー動作しない（カウントしない）*/


#endif	// _LCM_DATA_H_

