/*[]--------------------------------------------------------------------------------------------------[]*/
/*|		設定ﾃｰﾌﾞﾙ定義																				   |*/
/*[]--------------------------------------------------------------------------------------------------[]*/
/*|	FILE NAME	:	prm_tbl.h																		   |*/
/*[]--------------------------------------------------------------------------------------------------[]*/
/*| Author      :																					   |*/
/*| Date        :	2005-03-10																		   |*/
/*| Update      :																					   |*/
/*|----------------------------------------------------------------------------------------------------|*/
/*| ・設定ﾃｰﾌﾞﾙ宣言及び設定値取得に関連するﾌﾟﾛﾄﾀｲﾌﾟ宣言												   |*/
/*|																									   |*/
/*[]------------------------------------------------------- Copyright(C) 2005 AMANO Corp.-------------[]*/
#ifndef _PRM_TBL_H_
#define _PRM_TBL_H_

/*[]--------------------------------------------------------------------------------------------------[]*/
/*|	設定関連ﾃﾞﾌｧｲﾝ																					   |*/
/*| ・設定関連の固定値を登録する。																	   |*/
/*[]--------------------------------------------------------------------------------------------------[]*/
																		/*								*/
#define		COM_PRM			0											/* 共通ﾊﾟﾗﾒｰﾀ					*/
#define		PEC_PRM			1											/* 個別ﾊﾟﾗﾒｰﾀ					*/
																		/*								*/
/*------------------------------------------------------------------------------------------------------*/
/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝMAX																						*/
/*------------------------------------------------------------------------------------------------------*/
#define		C_PRM_SESCNT_MAX	61										/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ数				*/

#define		P_PRM_SESCNT_MAX	4										/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ数				*/
																		/*								*/
/*------------------------------------------------------------------------------------------------------*/
/* 共通ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ番号(ﾊﾟﾗﾒｰﾀのｾｯｼｮﾝ番号定義)															*/
/*------------------------------------------------------------------------------------------------------*/
#define		S_SYS		1												/* ｼｽﾃﾑ							*/
#define		S_PAY		2												/* 精算機固有					*/
#define		S_TYP		3												/* 精算機ﾀｲﾌﾟ別					*/
#define		S_TOK		4												/* 特別日						*/
#define		S_TIK		5												/* 駐車券/定期券				*/
#define		S_SHA		6												/* 車種							*/
#define		S_PAS		7												/* 定期券						*/
#define		S_DIS		8												/* 割引							*/
#define		S_SER		9												/* ｻｰﾋﾞｽ券						*/
#define		S_STO		10												/* 店割引						*/
#define		S_TAT		11												/* 多店舗						*/
#define		S_WAR		12												/* 割引券						*/
#define		S_PRP		13												/* ﾌﾟﾘﾍﾟｲﾄﾞ/回数券				*/
#define		S_TOT		14												/* 集計							*/
#define		S_TOP		15												/* 集計ﾌﾟﾘﾝﾄ					*/
#define		S_BUN		16												/* 分類集計						*/
#define		S_RTP		17												/* 領収証						*/
#define		S_PRN		18												/* 印字関連						*/
#define		S_MON		19												/* 金種							*/
#define		S_KAN		20												/* 金銭管理						*/
#define		S_OTP		21												/* 出力信号						*/
#define		S_INP		22												/* 入力信号						*/
#define		S_DSP		24												/* 案内表示						*/
#define		S_ANA		25												/* 案内放送						*/
#define		S_REC		26												/* 情報記録						*/
#define		S_PSW		27												/* ﾊﾟｽﾜｰﾄﾞ						*/
#define		S_CAL		28												/* 料金計算基本					*/
#define		S_STM		29												/* ｻｰﾋﾞｽﾀｲﾑ						*/
#define		S_PTM		30												/* 定期開始/終了				*/
#define		S_RAT		31												/* 昼夜帯/逓減帯				*/
#define		S_KOU		32												/* 定期更新						*/
#define		S_MIF		33												/* Mifare ｾｯｼｮﾝ№				*/
#define		S_NTN		34												/* NT-NET						*/
#define		S_SCA		35												/* Suica						*/
#define		S_CEN		36												/* ｾﾝﾀｰｻｰﾊﾞｰ接続ﾊﾟﾗﾒｰﾀ設定	*/
#define		S_CRE		38												/* クレジット設定 */
// GM849100(S) 個別設定
#define		S_SSS		40												// 個別設定
// GM849100(E) 個別設定
#define		S_MDL		41												/* 標準通信ﾓｼﾞｭｰﾙ				*/
#define		S_LTM		46												/* 料金種別毎設定 */
// MH810100(S) K.Onodera 2019/10/31 車番チケットレス（LCD通信）
#define		S_PKT		48												// LCD通信設定
// MH810100(E) K.Onodera 2019/10/31 車番チケットレス（LCD通信）
#define		S_RDL		49												/* 遠隔ダウンロード				*/
// MH321800(S) G.So ICクレジット対応
#define		S_ECR		50												/* 決済リーダ設定 */
// MH321800(E) G.So ICクレジット対応
#define		S_CLX		56												/* 料金計算拡張 */
#define		S_CLC		57												/* 定期料金体系 */
#define		S_CLA		58												/* 第4～第6料金体系 */
#define		S_CLB		59												/* 第7～第9料金体系 */
// MH810100(S) K.Onodera 2019/12/03 車番チケットレス（設定見直し）
//																		/*								*/
//#define		C_PRM_SESCNT_END	S_CLB
#define		S_LCD		60												// LCDモジュール専用設定

#define		C_PRM_SESCNT_END	S_LCD
// MH810100(E) K.Onodera 2019/12/03 車番チケットレス（設定見直し）
																		/*								*/
/*------------------------------------------------------------------------------------------------------*/
/* 個別ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ番号(ﾊﾟﾗﾒｰﾀのｾｯｼｮﾝ番号定義)															*/
/*------------------------------------------------------------------------------------------------------*/
#define		S_P01		1												/*								*/
#define		S_P02		2												/*								*/
#define		S_P03		3												/*								*/
																		/*								*/
/*------------------------------------------------------------------------------------------------------*/
/* 共通ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ(各ﾊﾟﾗﾒｰﾀｾｯｼｮﾝの設定ｱﾄﾞﾚｽ数を定義する)												*/
/*------------------------------------------------------------------------------------------------------*/
#define		C_PRM_SES01		100											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ01設定数			*/
#define		C_PRM_SES02		100											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ02設定数			*/
#define		C_PRM_SES03		150											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ03設定数			*/
// MH810100(S) Y.Yoshida 2020/06/04 車番チケットレス(#4109 マスク項目が共通パラメータ仕様書と異なっている)
//#define		C_PRM_SES04		70											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ04設定数			*/
#define		C_PRM_SES04		80											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ04設定数			*/
// MH810100(E) Y.Yoshida 2020/06/04 車番チケットレス(#4109 マスク項目が共通パラメータ仕様書と異なっている)
#define		C_PRM_SES05		30											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ05設定数			*/
#define		C_PRM_SES06		75											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ06設定数			*/
#define		C_PRM_SES07		150											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ07設定数			*/
#define		C_PRM_SES08		27											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ08設定数			*/
#define		C_PRM_SES09		140											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ09設定数			*/
#define		C_PRM_SES10		300											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ10設定数			*/
// MH810104(S) R.Endo 2021/08/18 車番チケットレス フェーズ2.3 #5793 多店舗割引店№999対応
// #define		C_PRM_SES11		186											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ11設定数			*/
#define		C_PRM_SES11		930											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ11設定数			*/
// MH810104(E) R.Endo 2021/08/18 車番チケットレス フェーズ2.3 #5793 多店舗割引店№999対応
#define		C_PRM_SES12		301											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ12設定数			*/
// MH322914 (s) kasiyama 2016/07/12 GT7000に合わせて期限切れ間近案内を可変日数とする(共通改善No.1212)(MH341106)回数券期限切れ予告
//#define		C_PRM_SES13		15											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ13設定数			*/
#define		C_PRM_SES13		24											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ13設定数			*/
// MH322914 (e) kasiyama 2016/07/12 GT7000に合わせて期限切れ間近案内を可変日数とする(共通改善No.1212)(MH341106)回数券期限切れ予告
#define		C_PRM_SES14		25											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ14設定数			*/
#define		C_PRM_SES15		50											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ15設定数			*/
#define		C_PRM_SES16		60											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ16設定数			*/
#define		C_PRM_SES17		60											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ17設定数			*/
// 仕様変更(S) K.Onodera 2016/11/08 後日支払額フッター
//#define		C_PRM_SES18		50											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ18設定数			*/
#define		C_PRM_SES18		100											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ18設定数			*/
// 仕様変更(E) K.Onodera 2016/11/08 後日支払額フッター
#define		C_PRM_SES19		30											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ19設定数			*/
#define		C_PRM_SES20		65											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ20設定数			*/
#define		C_PRM_SES21		32											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ21設定数			*/
#define		C_PRM_SES22		13											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ22設定数			*/
#define		C_PRM_SES23		30											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ23設定数			*/
#define		C_PRM_SES24		40											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ24設定数			*/
// MH810100(S) 2020/06/02 精算機案内放送設定拡張
//#define		C_PRM_SES25		200											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ25設定数			*/
#define		C_PRM_SES25		400											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ25設定数			*/
// MH810100(E) 2020/06/02 精算機案内放送設定拡張
// MH810104 GG119201(S) 電子ジャーナル対応
//#define		C_PRM_SES26		5											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ26設定数			*/
#define		C_PRM_SES26		20											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ26設定数			*/
// MH810104 GG119201(E) 電子ジャーナル対応
// MH810100(S) Y.Yoshida 2020/06/05 車番チケットレス(#4109 マスク項目が共通パラメータ仕様書と異なっている)
//#define		C_PRM_SES27		20											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ27設定数			*/
#define		C_PRM_SES27		100											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ27設定数			*/
// MH810100(E) Y.Yoshida 2020/06/05 車番チケットレス(#4109 マスク項目が共通パラメータ仕様書と異なっている)
#define		C_PRM_SES28		55											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ28設定数			*/
#define		C_PRM_SES29		40											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ29設定数			*/
#define		C_PRM_SES30		150											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ30設定数			*/
#define		C_PRM_SES31		900											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ31設定数			*/
#define		C_PRM_SES32		240											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ32設定数			*/
#define		C_PRM_SES33		100											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ33設定数			*/
#define		C_PRM_SES34		150											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ34設定数			*/
#define		C_PRM_SES35		100											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ35設定数			*/
#define		C_PRM_SES36		100											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ36設定数			*/
#define		C_PRM_SES37		100											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ37設定数			*/
#define		C_PRM_SES38		100											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ38設定数			*/
#define		C_PRM_SES39		200											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ39設定数			*/
#define		C_PRM_SES40		100											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ40設定数			*/
#define		C_PRM_SES41		100											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ41設定数			*/
#define		C_PRM_SES42		100											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ42設定数			*/
#define		C_PRM_SES43		10											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ43設定数			*/
#define		C_PRM_SES44		10											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ44設定数			*/
#define		C_PRM_SES45		50											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ45設定数			*/
#define		C_PRM_SES46		200											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ46設定数			*/
#define		C_PRM_SES47		100											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ47設定数			*/
#define		C_PRM_SES48		100											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ48設定数			*/
#define		C_PRM_SES49		100											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ49設定数			*/
#define		C_PRM_SES50		100											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ50設定数			*/
#define		C_PRM_SES51		20											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ51設定数			*/
#define		C_PRM_SES52		50											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ52設定数			*/
#define		C_PRM_SES53		100											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ53設定数			*/
#define		C_PRM_SES54		100											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ54設定数			*/
#define		C_PRM_SES55		100											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ55設定数			*/
#define		C_PRM_SES56		100											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ56設定数			*/
#define		C_PRM_SES57		300											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ57設定数			*/
#define		C_PRM_SES58		900											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ58設定数			*/
#define		C_PRM_SES59		900											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ59設定数			*/
// MH810100(S) K.Onodera 2019/12/03 車番チケットレス（設定見直し）
//#define		C_PRM_SES60		100											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ60設定数			*/
// MH810101(S) R.Endo 2021/02/17 車番チケットレス フェーズ2 バーコード対応
//#define		C_PRM_SES60		200											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ60設定数			*/
#define		C_PRM_SES60		800											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ60設定数			*/
// MH810101(E) R.Endo 2021/02/17 車番チケットレス フェーズ2 バーコード対応
// MH810100(E) K.Onodera 2019/12/03 車番チケットレス（設定見直し）
																		/*								*/
/*------------------------------------------------------------------------------------------------------*/
/* 個別ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ(各ﾊﾟﾗﾒｰﾀｾｯｼｮﾝの設定ｱﾄﾞﾚｽ数を定義する)												*/
/*------------------------------------------------------------------------------------------------------*/
#define		P_PRM_SES01		100											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ01設定数			*/
#define		P_PRM_SES02		30											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ02設定数			*/
#define		P_PRM_SES03		20											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ03設定数			*/
																		/*								*/
																		/*------------------------------*/
																		/*								*/
																		/*------------------------------*/
																		/*								*/
/*------------------------------------------------------------------------------------------------------*/
/*	ｾｯｼｮﾝﾊﾟﾗﾒｰﾀﾃｰﾌﾞﾙ宣言																				*/
/*------------------------------------------------------------------------------------------------------*/
extern	const ushort	CPrmCnt[];										/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ数格納配列		*/
																		/*								*/
typedef	struct {														/*								*/
	long	CParam00[1];												/* ｾｯｼｮﾝ00設定格納ﾊﾞｯﾌｧ(ｻﾑ値)	*/
																		/* 共通ﾊﾟﾗﾒｰﾀｻﾑ値格納ｴﾘｱ 		*/
																		/* (ushort[2] として使用)		*/
																		/* +0,1=サム値(CParam00～末尾までのushort毎和算値) */
																		/* +2,3=上記サム値のbit反転値	*/
	long	CParam01[C_PRM_SES01+1];									/* ｾｯｼｮﾝ01設定格納ﾊﾞｯﾌｧ			*/
	long	CParam02[C_PRM_SES02+1];									/* ｾｯｼｮﾝ02設定格納ﾊﾞｯﾌｧ			*/
	long	CParam03[C_PRM_SES03+1];									/* ｾｯｼｮﾝ03設定格納ﾊﾞｯﾌｧ			*/
	long	CParam04[C_PRM_SES04+1];									/* ｾｯｼｮﾝ04設定格納ﾊﾞｯﾌｧ			*/
	long	CParam05[C_PRM_SES05+1];									/* ｾｯｼｮﾝ05設定格納ﾊﾞｯﾌｧ			*/
	long	CParam06[C_PRM_SES06+1];									/* ｾｯｼｮﾝ06設定格納ﾊﾞｯﾌｧ			*/
	long	CParam07[C_PRM_SES07+1];									/* ｾｯｼｮﾝ07設定格納ﾊﾞｯﾌｧ			*/
	long	CParam08[C_PRM_SES08+1];									/* ｾｯｼｮﾝ08設定格納ﾊﾞｯﾌｧ			*/
	long	CParam09[C_PRM_SES09+1];									/* ｾｯｼｮﾝ09設定格納ﾊﾞｯﾌｧ			*/
	long	CParam10[C_PRM_SES10+1];									/* ｾｯｼｮﾝ10設定格納ﾊﾞｯﾌｧ			*/
	long	CParam11[C_PRM_SES11+1];									/* ｾｯｼｮﾝ11設定格納ﾊﾞｯﾌｧ			*/
	long	CParam12[C_PRM_SES12+1];									/* ｾｯｼｮﾝ12設定格納ﾊﾞｯﾌｧ			*/
	long	CParam13[C_PRM_SES13+1];									/* ｾｯｼｮﾝ13設定格納ﾊﾞｯﾌｧ			*/
	long	CParam14[C_PRM_SES14+1];									/* ｾｯｼｮﾝ14設定格納ﾊﾞｯﾌｧ			*/
	long	CParam15[C_PRM_SES15+1];									/* ｾｯｼｮﾝ15設定格納ﾊﾞｯﾌｧ			*/
	long	CParam16[C_PRM_SES16+1];									/* ｾｯｼｮﾝ16設定格納ﾊﾞｯﾌｧ			*/
	long	CParam17[C_PRM_SES17+1];									/* ｾｯｼｮﾝ17設定格納ﾊﾞｯﾌｧ			*/
	long	CParam18[C_PRM_SES18+1];									/* ｾｯｼｮﾝ18設定格納ﾊﾞｯﾌｧ			*/
	long	CParam19[C_PRM_SES19+1];									/* ｾｯｼｮﾝ19設定格納ﾊﾞｯﾌｧ			*/
	long	CParam20[C_PRM_SES20+1];									/* ｾｯｼｮﾝ20設定格納ﾊﾞｯﾌｧ			*/
	long	CParam21[C_PRM_SES21+1];									/* ｾｯｼｮﾝ21設定格納ﾊﾞｯﾌｧ			*/
	long	CParam22[C_PRM_SES22+1];									/* ｾｯｼｮﾝ22設定格納ﾊﾞｯﾌｧ			*/
	long	CParam23[C_PRM_SES23+1];									/* ｾｯｼｮﾝ23設定格納ﾊﾞｯﾌｧ			*/
	long	CParam24[C_PRM_SES24+1];									/* ｾｯｼｮﾝ24設定格納ﾊﾞｯﾌｧ			*/
	long	CParam25[C_PRM_SES25+1];									/* ｾｯｼｮﾝ25設定格納ﾊﾞｯﾌｧ			*/
	long	CParam26[C_PRM_SES26+1];									/* ｾｯｼｮﾝ26設定格納ﾊﾞｯﾌｧ			*/
	long	CParam27[C_PRM_SES27+1];									/* ｾｯｼｮﾝ27設定格納ﾊﾞｯﾌｧ			*/
	long	CParam28[C_PRM_SES28+1];									/* ｾｯｼｮﾝ28設定格納ﾊﾞｯﾌｧ			*/
	long	CParam29[C_PRM_SES29+1];									/* ｾｯｼｮﾝ29設定格納ﾊﾞｯﾌｧ			*/
	long	CParam30[C_PRM_SES30+1];									/* ｾｯｼｮﾝ30設定格納ﾊﾞｯﾌｧ			*/
	long	CParam31[C_PRM_SES31+1];									/* ｾｯｼｮﾝ31設定格納ﾊﾞｯﾌｧ			*/
	long	CParam32[C_PRM_SES32+1];									/* ｾｯｼｮﾝ32設定格納ﾊﾞｯﾌｧ			*/
	long	CParam33[C_PRM_SES33+1];									/* ｾｯｼｮﾝ33設定格納ﾊﾞｯﾌｧ			*/
	long	CParam34[C_PRM_SES34+1];									/* ｾｯｼｮﾝ34設定格納ﾊﾞｯﾌｧ			*/
	long	CParam35[C_PRM_SES35+1];									/* ｾｯｼｮﾝ35設定格納ﾊﾞｯﾌｧ			*/
	long	CParam36[C_PRM_SES36+1];									/* ｾｯｼｮﾝ36設定格納ﾊﾞｯﾌｧ			*/
	long	CParam37[C_PRM_SES37+1];									/* ｾｯｼｮﾝ37設定格納ﾊﾞｯﾌｧ			*/
	long	CParam38[C_PRM_SES38+1];									/* ｾｯｼｮﾝ38設定格納ﾊﾞｯﾌｧ			*/
	long	CParam39[C_PRM_SES39+1];									/* ｾｯｼｮﾝ39設定格納ﾊﾞｯﾌｧ			*/
	long	CParam40[C_PRM_SES40+1];									/* ｾｯｼｮﾝ40設定格納ﾊﾞｯﾌｧ			*/
	long	CParam41[C_PRM_SES41+1];									/* ｾｯｼｮﾝ41設定格納ﾊﾞｯﾌｧ			*/
	long	CParam42[C_PRM_SES42+1];									/* ｾｯｼｮﾝ42設定格納ﾊﾞｯﾌｧ			*/
	long	CParam43[C_PRM_SES43+1];									/* ｾｯｼｮﾝ43設定格納ﾊﾞｯﾌｧ			*/
	long	CParam44[C_PRM_SES44+1];									/* ｾｯｼｮﾝ44設定格納ﾊﾞｯﾌｧ			*/
	long	CParam45[C_PRM_SES45+1];									/* ｾｯｼｮﾝ45設定格納ﾊﾞｯﾌｧ			*/
	long	CParam46[C_PRM_SES46+1];									/* ｾｯｼｮﾝ46設定格納ﾊﾞｯﾌｧ			*/
	long	CParam47[C_PRM_SES47+1];									/* ｾｯｼｮﾝ47設定格納ﾊﾞｯﾌｧ			*/
	long	CParam48[C_PRM_SES48+1];									/* ｾｯｼｮﾝ48設定格納ﾊﾞｯﾌｧ			*/
	long	CParam49[C_PRM_SES49+1];									/* ｾｯｼｮﾝ49設定格納ﾊﾞｯﾌｧ			*/
	long	CParam50[C_PRM_SES50+1];									/* ｾｯｼｮﾝ50設定格納ﾊﾞｯﾌｧ			*/
	long	CParam51[C_PRM_SES51+1];									/* ｾｯｼｮﾝ51設定格納ﾊﾞｯﾌｧ			*/
	long	CParam52[C_PRM_SES52+1];									/* ｾｯｼｮﾝ52設定格納ﾊﾞｯﾌｧ			*/
	long	CParam53[C_PRM_SES53+1];									/* ｾｯｼｮﾝ53設定格納ﾊﾞｯﾌｧ			*/
	long	CParam54[C_PRM_SES54+1];									/* ｾｯｼｮﾝ54設定格納ﾊﾞｯﾌｧ			*/
	long	CParam55[C_PRM_SES55+1];									/* ｾｯｼｮﾝ55設定格納ﾊﾞｯﾌｧ			*/
	long	CParam56[C_PRM_SES56+1];									/* ｾｯｼｮﾝ56設定格納ﾊﾞｯﾌｧ			*/
	long	CParam57[C_PRM_SES57+1];									/* ｾｯｼｮﾝ57設定格納ﾊﾞｯﾌｧ			*/
	long	CParam58[C_PRM_SES58+1];									/* ｾｯｼｮﾝ58設定格納ﾊﾞｯﾌｧ			*/
	long	CParam59[C_PRM_SES59+1];									/* ｾｯｼｮﾝ59設定格納ﾊﾞｯﾌｧ			*/
	long	CParam60[C_PRM_SES60+1];									/* ｾｯｼｮﾝ60設定格納ﾊﾞｯﾌｧ			*/
} t_CParam;																/*								*/
extern	t_CParam	CParam;												/* 共通パラメータエリア			*/
																		/* 								*/
																		/* 								*/
																		/* 								*/
extern	long	*CPrmSS[];												/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝﾃｰﾌﾞﾙ				*/
																		/* 								*/
extern	const short	PPrmCnt[];											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝ数格納配列		*/
																		/* 								*/
typedef	struct {														/*								*/
	long	PParam00[1];												/* ｾｯｼｮﾝ00設定格納ﾊﾞｯﾌｧ(ﾀﾞﾐｰ)	*/
	long	PParam01[P_PRM_SES01+1];									/* ｾｯｼｮﾝ01設定格納ﾊﾞｯﾌｧ			*/
	long	PParam02[P_PRM_SES02+1];									/* ｾｯｼｮﾝ02設定格納ﾊﾞｯﾌｧ			*/
	long	PParam03[P_PRM_SES03+1];									/* ｾｯｼｮﾝ03設定格納ﾊﾞｯﾌｧ			*/
} t_PParam;																/*								*/
extern	t_PParam	PParam;												/* 個別パラメータエリア			*/
																		/* 								*/
extern	long		*PPrmSS[];											/* ﾊﾟﾗﾒｰﾀｾｯｼｮﾝﾃｰﾌﾞﾙ				*/
																		/*								*/
/*------------------------------------------------------------------------------------------------------*/
/*	ﾊﾟﾗﾒｰﾀﾃﾞﾌｫﾙﾄ																						*/
/*------------------------------------------------------------------------------------------------------*/
																		/*								*/
struct	PRM_REC{														/* ﾊﾟﾗﾒｰﾀﾃﾞﾌｫﾙﾄ値用構造体		*/
	uchar	ses;														/*								*/
	short	adr;														/*								*/
	long	dat;														/*								*/
};																		/*								*/
																		/*								*/
extern	const struct	PRM_REC	cprm_rec[];								/* 共通ﾊﾟﾗﾒｰﾀﾃﾞﾌｫﾙﾄ				*/
extern	const struct	PRM_REC	pprm_rec[];								/* 固有ﾊﾟﾗﾒｰﾀﾃﾞﾌｫﾙﾄ				*/
																		/*								*/
/*------------------------------------------------------------------------------------------------------*/
/*	ｾｯｼｮﾝﾊﾟﾗﾒｰﾀﾃｰﾌﾞﾙ参照関数宣言																		*/
/*------------------------------------------------------------------------------------------------------*/
extern	long	prm_get( char, short, short, char, char );				/* ﾊﾟﾗﾒｰﾀ参照					*/
extern	long	prm_tim( char, short, short );							/* 時間取得						*/
extern	void	prm_init( char );										/* ﾊﾟﾗﾒｰﾀ格納ｱﾄﾞﾚｽ取得			*/
extern	void	prm_clr( char, char, char );							/* 共通/固有ﾊﾟﾗﾒｰﾀｸﾘｱ/ﾃﾞﾌｫﾙﾄ	*/
extern	void	lockinfo_clr( char );									/* 車室ﾊﾟﾗﾒｰﾀのﾃﾞﾌｫﾙﾄ			*/
extern	void	lockmaker_clr( char );									/* ﾛｯｸ装置ﾊﾟﾗﾒｰﾀのﾃﾞﾌｫﾙﾄ		*/
extern	ulong	prm_svtim( ushort, uchar );								/* ｻｰﾋﾞｽﾀｲﾑ取得					*/
extern	long	default_prm_get( uchar ses, ushort addr, ushort *pos);	/* ﾃﾞﾌｫﾙﾄﾊﾟﾗﾒｰﾀ取得				*/
extern	void	prm_invalid_change( short, short, long* );				/* 固定ﾊﾟﾗﾒｰﾀ変換				*/
extern	uchar	prm_invalid_check( void );								/* 固定ﾊﾟﾗﾒｰﾀ変換ﾁｪｯｸ			*/
extern	void	prm_oiban_chk( void );									/* 追番カウンタチェック */
																		/*								*/
																		/*------------------------------*/
extern	long	nomask_next( long add );
extern	long	nomask_prev( long add );
extern	long	nomask_all_next( long add );
extern	long	nomask_all_prev( long add );
extern	long	nomask_ses_next( long add );
extern	long	nomask_ses_prev( long add );
// GG124100(S) R.Endo 2022/06/02 車番チケットレス3.0 #6343 クラウド料金計算対応(設定非表示)
extern	long	is_nomask( long current_add );
// GG124100(E) R.Endo 2022/06/02 車番チケットレス3.0 #6343 クラウド料金計算対応(設定非表示)
#endif	// _PRM_TBL_H_
