/*[]----------------------------------------------------------------------[]*/
/*| Maintenance control header file                                        |*/
/*[]----------------------------------------------------------------------[]*/
/*| Author      :                                                          |*/
/*| Date        :  2XXX-XX-XX                                              |*/
/*[]------------------------------------- Copyright(C) 2002 AMANO Corp.---[]*/

#include	<string.h>
#include	<stdio.h>
#include	"iodefine.h"
#include	"system.h"
#include	"mem_def.h"
#include	"rkn_def.h"
#include	"rkn_cal.h"
#include	"ope_def.h"
#include	"Message.h"
#include	"lcd_def.h"
#include	"Strdef.h"
#include	"mnt_def.h"
#include	"PRM_TBL.H"
#include	"LKmain.h"
#include	"flp_def.h"
#include	"remote_dl.h"

/*--------------------------------------------------------------------------*/
/*	Menu Table																*/
/*--------------------------------------------------------------------------*/
/* Attendant */
/* User Maintenance 0-59 */
// GG124100(S) R.Endo 2022/06/02 車番チケットレス3.0 #6343 クラウド料金計算対応(メンテナンス非表示)
// ※USER_TBLを変更する場合はUSER_TBL_CCも同時にメンテナンスする
// GG124100(E) R.Endo 2022/06/02 車番チケットレス3.0 #6343 クラウド料金計算対応(メンテナンス非表示)
const	unsigned short	USER_TBL[][4] = {
							{ 0,	26,	__MNT_ERARM,		MNT_ERARM      },	// .エラー・アラーム確認
// MH810100(S) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)
//							{ 0,	20,	__MNT_FLCTL,		MNT_FLCTL      },	// .ロック装置開閉
// MH810100(E) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)
							{ 0,	14,	__MNT_MNCNT,		MNT_MNCNT      },	// .釣銭管理
							{ 0,	12,	__MNT_TTOTL,		MNT_TTOTL      },	// .Ｔ集計
							{ 0,	14,	__MNT_GTOTL,		MNT_GTOTL      },	// .ＧＴ集計
// MH810100(S) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)
//							{ 0,	16,	__MNT_STAYD,		MNT_STAYD      },	// .停留車情報
//							{ 0,	22,	__MNT_LOGPRN,		MNT_LOGPRN     },	// .履歴情報プリント
//						    { 0,	14,	__MNT_FLCNT,		MNT_FLCNT      },	// .駐車台数
//						    { 0,	22,	__MNT_FLCTRL,		MNT_FLCTRL     },	// .満車コントロール
// MH810100(E) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)
							{ 0,	14,	__MNT_STSVIEW,		MNT_STSVIEW    },	// .状態確認
// MH810100(S) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)
//						    { 0,	14,	__MNT_FLSTS,		MNT_FLSTS      },	// .車室情報
//						    { 0,	14,	__MNT_CARFAIL,		MNT_CARFAIL    },	// .車室故障
// MH810100(E) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)
							{ 0,	18,	__MNT_REPRT,		MNT_REPRT      },	// .領収証再発行
// MH810100(S) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)
//						    { 0,	16,	__MNT_UKERP,		MNT_UKERP      },	// .駐車証明書
//						    { 0,	20,	__MNT_INVLD,		MNT_INVLD      },	// .定期有効／無効
//						    { 0,	20,	__MNT_ENTRD,		MNT_ENTRD      },	// .定期入庫／出庫
//						    { 0,	26,	__MNT_PSTOP,		MNT_PSTOP      },	// .定期券精算中止データ
//						    { 0,	20,	__MNT_PASCK,		MNT_PASCK      },	// .定期券チェック
//						    { 0,	18,	__MNT_TKTDT,		MNT_TKTDT      },	// .券データ確認
							{ 0,	28,	__MNT_QRCHECK,		MNT_QRCHECK     },	// .QRデータ確認
// MH810100(E) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)
							{ 0,	16,	__MNT_CLOCK,		MNT_CLOCK      },	// .時計合わせ
							{ 0,	20,	__MNT_SERVS,		MNT_SERVS      },	// .サービスタイム
// MH810100(S) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)
//							{ 0,	26,	__MNT_FLTIM,		MNT_FLTIM      },	// .ロック装置開タイマー
// MH810100(E) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)
							{ 0,	22,	__MNT_SPCAL,		MNT_SPCAL      },	// .特別日／特別期間
							{ 0,	16,	__MNT_OPCLS,		MNT_OPCLS      },	// .営休業切替
// MH810100(S) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)
//							{ 0,	20,	__MNT_SHTER,		MNT_SHTER      },	// .シャッター開放
// MH810100(E) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)
							{ 0,	20,	__MNT_PWMOD,		MNT_PWMOD      },	// .係員パスワード
// MH810100(S) K.Onodera 2020/03/05 #3902 LCDタッチの効果音が2回鳴る
//							{ 0,	18,	__MNT_KEYVL,		MNT_KEYVL      },	// .キー音量調整
							{ 0,	20,	__MNT_KEYVL,		MNT_KEYVL      },	// .ブザー音量調整
// MH810100(E) K.Onodera 2020/03/05 #3902 LCDタッチの効果音が2回鳴る
							{ 0,	22,	__MNT_CNTRS,		MNT_CNTRS      },	// .輝度調整
							{ 0,	18,	__MNT_VLSW,			MNT_VLSW       },	// .音声案内時間
							{ 0,	18,	__MNT_OPNHR,		MNT_OPNHR      },	// .営業開始時刻
// MH810100(S) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)
//							{ 0,	12,	__MNT_TKEXP,		MNT_TKEXP      },	// .券期限
// MH810100(E) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)
							{ 0,	14,	__MNT_MNYSET,		MNT_MNYSET     },	// .料金設定							
// MH810100(S) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)
//							{ 0,	20,	__MNT_ATTENDDATA,	MNT_ATTENDDATA },	// .係員有効データ
//							{ 0,	22,	__MNT_PWDKY,		MNT_PWDKY	   },	// .解除番号強制出庫 */
// MH810100(E) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)
							{ 0,	14,	__MNT_EXTEND,		MNT_EXTEND     },	// .拡張機能
};

/* Engeneer */
/* System Maintenance 60-79 */
// GG124100(S) R.Endo 2022/06/02 車番チケットレス3.0 #6343 クラウド料金計算対応(メンテナンス非表示)
// ※SYS_TBLを変更する場合はSYS_TBL_CCも同時にメンテナンスする
// GG124100(E) R.Endo 2022/06/02 車番チケットレス3.0 #6343 クラウド料金計算対応(メンテナンス非表示)
const	unsigned short	SYS_TBL[][4] = {
							{ 0,	20,	0,	MNT_PRSET },	/*  1.パラメーター設定 */
							{ 0,	16,	1,	MNT_FNCHK },	/*  2.動作チェック */
							{ 0,	16,	2,	MNT_FNCNT },	/*  3.動作カウント */
							{ 0,	24,	3,	MNT_LOGFL },	/*  4.ログファイルプリント */
							{ 0,	26,	4,	MNT_BAKRS },	/*  5.バックアップ／リストア */
// MH810100(S) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)
//							 { 0,	14,	5,	MNT_CDISS },	/*  6.カード発行 */
//							{ 0,	16,	6,	MNT_FLTRF },	/*  7.ファイル転送 */
//							{ 0,	16,	7,	MNT_SYSSW },	/*  8.システム切替 */
//							{ 0,	18,	8,	MNT_RYOTS },	/*  9.料金計算テスト */
							{ 0,	16,	5,	MNT_FLTRF },	/*  6.ファイル転送 */
							{ 0,	16,	6,	MNT_SYSSW },	/*  7.システム切替 */
							{ 0,	18,	7,	MNT_RYOTS },	/*  8.料金計算テスト */
// MH810100(E) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)
							{ 0,	26,	8,	MNT_INITI },	/* 10.スーパーイニシャライズ */
};

/* Parameter Setting 200-202 */
const	unsigned short	PARA_SET_TBL[][4] = {
							{ 0,	20,	0,	BASC_PARA },	/* 1.基本パラメーター */
							{ 0,	20,	1,	CELL_PARA },	/* 2.車室パラメーター */
							{ 0,	26,	2,	ROCK_PARA },	/* 3.ロック種別パラメーター */
};
/* Basic Parameter Setting 220-224 */
const	unsigned short	BPARA_SET_TBL[][4] = {
							{ 0,	20,	0,	CMON_PARA },	/* 1.共通パラメーター */
							{ 0,	12,	1,	PRNT_PARA },	/* 2.プリント */
							{ 0,	20,	2,	DEFA_PARA },	/* 3.デフォルトセット */
};

// ファイル転送
const	unsigned short	FILE_TRF_TBL[][4] = {
							{ 0,	30,	0,	FILE_FTP_CLI},		/* 2.FTP接続(クライアント) */
							{ 0,	26,	1,	FILE_FTP_SEV},		/* 3.FTP接続(サーバー) */
};

// システム切替
const	unsigned short	SYS_SW_TBL[][4] = {
							{ 0,	20,	0,	SYS_MAIN_PRO},		/* 1.メインプログラム */
// MH810100(S) K.Onodera 2019/10/17 車番チケットレス(メンテナンス)
//							{ 0,	18,	1,	SYS_SUB_PRO},		/* 2.サブプログラム */
//							{ 0,	20,	2,	SYS_COM_PRM},		/* 3.共通パラメーター */
							{ 0,	20,	1,	SYS_COM_PRM},		/* 2.共通パラメーター */
// MH810100(E) K.Onodera 2019/10/17 車番チケットレス(メンテナンス)
};

// NTNETチェックメニュー
const	unsigned short	FNTNET_CHK_TBL[][4] = {
							{ 0,	16,	0,	FNTNET1_CHK },		// 1: データクリア
							{ 0,	24,	1,	FNTNET2_CHK },		// 2: 通信モジュール初期化
							{ 0,	12,	2,	FNTNET3_CHK },		// 3: 状態表示
};

const	unsigned short	UPDN_TBL[][4] = {
							{ 0,	16,	0,	UPDN_UP },
							{ 0,	16,	1,	UPDN_DN },
};

// ｱｯﾌﾟﾛｰﾄﾞﾃｰﾌﾞﾙ
const	unsigned short	UPLORD_TBL[][4] = {
							{ 0,	18,	0,	LD_LOGO },
							{ 0,	22,	1,	LD_HDR },
							{ 0,	22,	2,	LD_FTR },
							{ 0,	22,	3,	LD_PARA },
							{ 0,	22,	4,	LD_LOCKPARA },
							{ 0,	16,	5,	LD_SLOG },
							{ 0,	16,	6,	LD_TLOG },
							{ 0,	24,	7,	LD_ACCEPTFTR },
							{ 0,	22,	8,	LD_SYOM },
							{ 0,	24,	9,	LD_KAME },
							{ 0,	24,	10,	LD_EDYAT },
							{ 0,	18,11,	LD_USERDEF },
							{ 0,	16,12,	LD_LOG_DATA },
							{ 0,	14,13,	LD_CAR_INFO },
							{ 0,	22,14,	LD_TCARD_FTR },
							{ 0,	20,15,	LD_AZU_FTR },
// 仕様変更(S) K.Onodera 2016/10/28 #1531 領収証フッターを印字する
							{ 0,	20,16,	LD_CREKBR_FTR },
							{ 0,	20,17,	LD_EPAYKBR_FTR },
							{ 0,	20,18,	LD_FUTURE_FTR },
// 仕様変更(E) K.Onodera 2016/10/28 #1531 領収証フッターを印字する
};

// ﾀﾞｳﾝﾛｰﾄﾞﾃｰﾌﾞﾙ
const	unsigned short	DWLORD_TBL[][4] = {
// ※ユーザ定義が追加された結果、番号２桁になり、反転幅が変わった。
							{ 0,	18,	0,	LD_LOGO },
							{ 0,	22,	1,	LD_HDR },
							{ 0,	22,	2,	LD_FTR },
							{ 0,	22,	3,	LD_PARA },
							{ 0,	22,	4,	LD_LOCKPARA },
							{ 0,	24,	5,	LD_ACCEPTFTR },
							{ 0,	22,	6,	LD_SYOM },
							{ 0,	24,	7,	LD_KAME },
							{ 0,	24,	8,	LD_EDYAT },
							{ 0,	18,	9,	LD_USERDEF },
							{ 0,	14,10,	LD_CAR_INFO },
							{ 0,	22,11,	LD_TCARD_FTR },
							{ 0,	20,12,	LD_AZU_FTR },
// 仕様変更(S) K.Onodera 2016/10/28 #1531 領収証フッターを印字する
							{ 0,	20,13,	LD_CREKBR_FTR },
							{ 0,	20,14,	LD_EPAYKBR_FTR },
							{ 0,	20,15,	LD_FUTURE_FTR },
// 仕様変更(E) K.Onodera 2016/10/28 #1531 領収証フッターを印字する
};

const	unsigned short	UPLOAD_LOG_TBL[][4] = {
							{ 0,	16,	0,	LD_ERR },
							{ 0,	18,	1,	LD_ARM },
							{ 0,	16,	2,	LD_MONI },
							{ 0,	20,	3,	LD_OPE_MONI },
							{ 0,	26,	4,	LD_PAY_CAL },
};

const	char	UPLD_MAX = (char)(sizeof(UPLORD_TBL)/sizeof(UPLORD_TBL[0]));
const	char	DNLD_MAX = (char)(sizeof(DWLORD_TBL)/sizeof(DWLORD_TBL[0]));

const	unsigned short	BKRS_TBL[][4] = {
							{ 0,	24,	0,	BKRS_BK },
							{ 0,	20,	1,	BKRS_RS },
// MH810100(S) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)
//							{ 0,	16,	2,	BKRS_FLSTS },
// MH810100(E) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)
};

/* Function check 90-110 */
const	unsigned short	FUN_CHK_TBL[][4] = {
							{ 0,	22,	__swt_check,		SWT_CHK },			/* : スイッチチェック		*/
// MH810100(S) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)
//						    { 0,	22,	__kbd_check,		KBD_CHK },			/* : キー入力チェック		*/
//							{ 0,	20,	__lcd_check,		LCD_CHK },			/* : ＬＣＤチェック		*/
// MH810100(E) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)
							{ 0,	20,	__led_check,		LED_CHK },			/* : ＬＥＤチェック		*/
// MH810100(S) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)
//							{ 0,	24,	__sht_check,		SHT_CHK },			/* : シャッターチェック	*/
// MH810100(E) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)
							{ 0,	24,	__sig_check,		SIG_CHK },			/* : 入出力信号チェック	*/
							{ 0,	26,	__cmc_check,		CMC_CHK },			/* : コインメックチェック	*/
							{ 0,	26,	__bna_check,		BNA_CHK },			/* : 紙幣リーダーチェック	*/
							{ 0,	22,	__prt_check,		PRT_CHK },			/* : プリンタチェック		*/
// MH810100(S) Y.Yamauchi 2019/10/08 車番チケットレス(メンテナンス)
//							{ 0,	26,	__rdr_check,		RDR_CHK },			/* : 磁気リーダーチェック	*/
							{ 0,	26,	__qr_check,			QR_CHK },			/* : ＱＲリーダーチェック*/
// MH810100(E) Y.Yamauchi 2019/10/08 車番チケットレス(メンテナンス)
							{ 0,	24,	__ann_check,		ANN_CHK },			/* : アナウンスチェック	*/
							{ 0,	22,	__mem_check,		MEM_CHK },			/* : メモリーチェック		*/
// MH810100(S) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)
//						    { 0,	24,	__lck_check,		LCK_CHK },			/* : ロックIF盤チェック	*/
//							{ 0,	26,	__flp_check,		FLP_CHK },			/* : フラップ装置チェック	*/
//							{ 0,	30,	__crr_check,		CRR_CHK },			/* : フラップ制御基板チェック	*/
//							{ 0,	30,	__sca_check,		SUICA_CHK },		/* : 交通系ICリーダーチェック*/
//							{ 0,	30,	__pip_check,		PIP_CHK },			/* : Park i Proチェック		*/
// MH810100(E) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)
							{ 0,	24,	__lan_connect_chk,	LAN_CONNECT_CHK },	/* : ＬＡＮ接続チェック	*/
							{ 0,	26,	__funope_check,		FUNOPE_CHK },		/* : ＦＡＮチェック	*/
							{ 0,	26,	__centercom_check,	CCM_CHK },			/* : センター通信チェック	*/
// MH810100(S) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)
//						    { 0,	26,	__cre_check,		CRE_CHK },			/* : クレジットチェック	*/
							{ 0,	30,	__realtime_check,	REAL_CHK },			/* : リアルタイム通信チェック	*/
							{ 0,	30,	__dc_net_check,		DC_CHK },			/* : ＤＣ－ＮＥＴ通信チェック	*/
// MH810100(E) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)
							{ 0,	24,	__ver_check,		VER_CHK },			/* : バージョンチェック	*/
};

// MH321800(S) D.Inaba ICクレジット対応 (決済リーダチェックへ変更)
const	unsigned short	FUN_CHK_TBL2[][4] = {
							{ 0,	22,	__swt_check2,		SWT_CHK },			// : スイッチチェック
// MH810100(S) K.Onodera 2019/10/16 車番チケットレス(メンテナンス)
//							{ 0,	22,	__kbd_check,		KBD_CHK },			// : キー入力チェック
//							{ 0,	20,	__lcd_check,		LCD_CHK },			// : ＬＣＤチェック
// MH810100(E) K.Onodera 2019/10/16 車番チケットレス(メンテナンス)
							{ 0,	20,	__led_check2,		LED_CHK },			// : ＬＥＤチェック
// MH810100(S) K.Onodera 2019/10/16 車番チケットレス(メンテナンス)
//							{ 0,	24,	__sht_check,		SHT_CHK },			// : シャッターチェック
// MH810100(E) K.Onodera 2019/10/16 車番チケットレス(メンテナンス)
							{ 0,	24,	__sig_check2,		SIG_CHK },			// : 入出力信号チェック
							{ 0,	26,	__cmc_check2,		CMC_CHK },			// : コインメックチェック
							{ 0,	26,	__bna_check2,		BNA_CHK },			// : 紙幣リーダーチェック
							{ 0,	22,	__prt_check2,		PRT_CHK },			// : プリンタチェック
// MH810100(S) K.Onodera 2019/10/16 車番チケットレス(メンテナンス)
//							{ 0,	26,	__rdr_check,		RDR_CHK },			// : 磁気リーダーチェック
							{ 0,	26,	__qr_check2,			QR_CHK },			/* : ＱＲリーダーチェック*/
// MH810100(E) K.Onodera 2019/10/16 車番チケットレス(メンテナンス)
							{ 0,	24,	__ann_check2,		ANN_CHK },			// : アナウンスチェック
							{ 0,	22,	__mem_check2,		MEM_CHK },			// : メモリーチェック
// MH810100(S) K.Onodera 2019/10/16 車番チケットレス(メンテナンス)
//							{ 0,	24,	__lck_check,		LCK_CHK },			// : ロックIF盤チェック
//							{ 0,	26,	__flp_check,		FLP_CHK },			// : フラップ装置チェック
//							{ 0,	30,	__crr_check,		CRR_CHK },			// : フラップ制御基板チェック
// MH810100(E) K.Onodera 2019/10/16 車番チケットレス(メンテナンス)
							{ 0,	24,	__sca_check2,		ECR_CHK },			// : 決済リーダチェック
// MH810100(S) Y.Yamauchi 2020/1/29 車番チケットレス(メンテナンス)
//							{ 0,	30,	__pip_check2,		PIP_CHK },			// : Park i Proチェック
// MH810100(E) Y.Yamauchi 2020/1/29 車番チケットレス(メンテナンス)
							{ 0,	24,	__lan_connect_chk2,	LAN_CONNECT_CHK },	// : ＬＡＮ接続チェック
							{ 0,	26,	__funope_check2,	FUNOPE_CHK },		// : ＦＡＮチェック
							{ 0,	26,	__centercom_check2,	CCM_CHK },			// : センター通信チェック
// MH810100(S) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)
//							{ 0,	26,	__cre_check,		CRE_CHK },			// : クレジットチェック
							{ 0,	30,	__realtime_check2,	REAL_CHK },			/* : リアルタイム通信チェック	*/
							{ 0,	30,	__dc_net_check2,	DC_CHK },			/* : DC-NET通信チェック	*/
// MH810100(E) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)
							{ 0,	24,	__ver_check2,		VER_CHK },			// : バージョンチェック
};
// MH321800(E) D.Inaba ICクレジット対応 (決済リーダチェックへ変更)


/* Function check 121-124 */
const	unsigned short	FLCD_CHK_TBL[][4] = {
// MH810100(S) Y.Yamauchi 2019/10/07 車番チケットレス(メンテナンス)	
//							{ 0,	22,	0,	FLCD1_CHK },		/*  1: RW Test */
//							{ 0,	20,	1,	FLCD2_CHK },		/*  2: Print Test */
							{ 0,	22,	0,	FLCD2_CHK },		/*  1: Print Test */
// MH810100(E) Y.Yamauchi 2019/10/07 車番チケットレス(メンテナンス)	
// MH810100(S) Y.Yamauchi 2019/10/07 車番チケットレス(メンテナンス)	
//							{ 0,	14,	2,	FLCD3_CHK },		/*  3: Status Check */
//							{ 0,	16,	3,	FLCD4_CHK },		/*  4: Version Check */
// MH810100(E) Y.Yamauchi 2019/10/07 車番チケットレス(メンテナンス)	
};

/* Function check 127-128 */
const	unsigned short	FSIG_CHK_TBL[][4] = {
							{ 0,	22,	0,	FSIG1_CHK },		/*  1: 入出力信号チェック		*/
							{ 0,	26,	1,	FSIG2_CHK },		/*  2: 入出力信号自動チェック	*/
};

/* Function check 131-134 */
const	unsigned short	FPRN_CHK_TBL1[][4] = {
							{ 0,	20,	0,	FPRNR_CHK },		/*  1: レシートプリンタ 	*/
							{ 0,	22,	1,	FPRNJ_CHK },		/*  2: ジャーナルプリンタ 	*/
// MH810104 GG119201(S) 電子ジャーナル対応
							{ 0,	18,	2,	FPRNEJ_CHK },		/*  3: 電子ジャーナル		*/
// MH810104 GG119201(E) 電子ジャーナル対応
};
const	unsigned short	FPRN_CHK_TBL2[][4] = {					// レシートプリンタ
							{ 0,	14,	0,	FPRN7_CHK },		/*  1: レシートテスト印刷	*/
							{ 0,	12,	1,	FPRN2_CHK },		/*  2: 状態確認			*/
							{ 0,	22,	2,	FPRN5_CHK },		/*  3: ロゴ印字データ登録	*/
};
const	unsigned short	FPRN_CHK_TBL3[][4] = {					// ジャーナルプリンタ
							{ 0,	14,	0,	FPRN3_CHK },		/*  1: テスト印字		*/
							{ 0,	12,	1,	FPRN4_CHK },		/*  2: 状態確認			*/
};
const	unsigned short	FPRN_CHK_TBL4[][4] = {					// レシートテスト印刷
							{ 0,	20,	0,	FPRN1_CHK },		/*  1: テストパタン印刷		*/
							{ 0,	14,	1,	FPRN8_CHK },		/*  2: 領収証印刷			*/
};
// MH810104 GG119201(S) 電子ジャーナル対応
const	unsigned short	FPRN_CHK_TBL5[][4] = {					// ジャーナルプリンタ
							{ 0,	24,	0,	FPRN_RW_CHK },		//  １: リード・ライトテスト
							{ 0,	18,	1,	FPRN_SD_CHK },		//  ２: ＳＤカード情報
							{ 0,	12,	2,	FPRN4_CHK },		//  ３: 状態確認
							{ 0,	18,	3,	FPRN_VER_CHK },		//  ４: バージョン確認
};
// MH810104 GG119201(E) 電子ジャーナル対応

/* Function check 141-144 */
const	unsigned short	FRDR_CHK_TBL[][4] = {
							{ 0,	24,	0,	FRD1_CHK },			//  1: リード・ライトテスト
							{ 0,	14,	1,	FRD2_CHK },			//  2: 印字テスト
							{ 0,	12,	2,	FRD3_CHK },			//  3: 状態確認
							{ 0,	24,	3,	FRD5_CHK },			//  4: ディップスイッチ確認
							{ 0,	18,	4,	FRD4_CHK },			//  5: バージョン確認
};

const	unsigned short	FCMC_CHK_TBL[][4] = {
							{ 0,	14,	0,	FCM1_CHK },			// 1: 入金テスト
							{ 0,	16,	1,	FCM2_CHK },			// 2: 払出しテスト
							{ 0,	12,	2,	FCM3_CHK },			// 3: 状態確認
							{ 0,	18,	3,	FCM4_CHK },			// 4: バージョン確認
};

const	unsigned short	FBNA_CHK_TBL[][4] = {
							{ 0,	14,	0,	FBN1_CHK },			//  1: 入金テスト
							{ 0,	12,	1,	FBN2_CHK },			//  2: 状態確認
							{ 0,	18,	2,	FBN3_CHK },			//  3: バージョン確認
};

/* ﾛｸﾞﾌｧｲﾙﾒﾆｭｰ 171-183 */
// GG124100(S) R.Endo 2022/06/02 車番チケットレス3.0 #6343 クラウド料金計算対応(メンテナンス非表示)
// ※LOG_FILE_TBLを変更する場合はLOG_FILE_TBL_CCも同時にメンテナンスする
// GG124100(E) R.Endo 2022/06/02 車番チケットレス3.0 #6343 クラウド料金計算対応(メンテナンス非表示)
const	unsigned short	LOG_FILE_TBL[][4] = {
							{ 0,	16,	0,	ERR_LOG },			/*  1: エラー情報 			*/
							{ 0,	18,	1,	ARM_LOG },			/*  2: アラーム情報 		*/
							{ 0,	16,	2,	TGOU_LOG },			/*  3: Ｔ合計情報 			*/
							{ 0,	18,	3,	GTGOU_LOG },		/*  4: ＧＴ合計情報 		*/
							{ 0,	20,	4,	COIN_LOG },			/*  5: コイン金庫情報 		*/
							{ 0,	18,	5,	NOTE_LOG },			/*  6: 紙幣金庫情報 		*/
							{ 0,	18,	6,	TURI_LOG },			/*  7: 釣銭管理情報 		*/

							{ 0,	18,	7,	SEISAN_LOG },		/*  8: 個別精算情報 		*/							
// MH810100(S) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)
//							{ 0,	24,	8,	FUSKYO_LOG },		/*  9: 不正・強制出庫情報 	*/
//							{ 0,	14,	9,	OPE_LOG },			/* 10: 操作情報 			*/
//							{ 0,	16,	10,	TEIFUK_LOG },		/* 11: 停復電情報 			*/
//							{ 0,	16,	11,	MONI_LOG },			/* 12: モニタ情報			*/
//							{ 0,	18,	12,	ADDPRM_LOG },		/* 13: 設定更新情報			*/
//							{ 0,	20,	13,	RTPAY_LOG },		/* 14: 料金テスト情報		*/
//							{ 0,	18,	14,	RMON_LOG },			/* 15: 遠隔監視情報			*/
//							{ 0,	24,	15,	CLEAR_LOG },		/* 16: ログファイルクリア	*/
							{ 0,	14,	8,	OPE_LOG },			/*  9: 操作情報 			*/
							{ 0,	16,	9,	TEIFUK_LOG },		/* 10: 停復電情報 			*/
							{ 0,	16,	10,	MONI_LOG },			/* 11: モニタ情報			*/
							{ 0,	18,	11,	ADDPRM_LOG },		/* 12: 設定更新情報			*/
							{ 0,	20,	12,	RTPAY_LOG },		/* 13: 料金テスト情報		*/
							{ 0,	18,	13,	RMON_LOG },			/* 14: 遠隔監視情報			*/
							{ 0,	24,	14,	CLEAR_LOG },		/* 15: ログファイルクリア	*/
// MH810100(E) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)							
};

/* Cell Parameter Setting 220-224 */
const	unsigned short	CPARA_SET_TBL[][4] = {
							{ 0,	20,	0,	CARP_PARA },		/* Cell Parameter */
							{ 0,	12,	1,	CARP_PRNT },		/* Print All Parameter */
							{ 0,	20,	2,	CARP_DEFA },		/* Default All Parameter */
};

/* Rock Parameter Setting 230-234 */
const	unsigned short	RPARA_SET_TBL[][4] = {
							{ 0,	26,	0,	RCKP_PARA },		/* Rockr Parameter */
							{ 0,	12,	1,	RCKP_PRNT },		/* Print All Parameter */
							{ 0,	20,	2,	RCKP_DEFA },		/* Default All Parameter */
};

const	unsigned short	USM_MNC_TBL1[][4] = {
							{ 0,	12,	0,	MNT_MNCNT },		/*  1: 釣銭補充				*/
							{ 0,	16,	1,	MNT_IVTRY },		/*  2: インベントリ			*/
							{ 0,	12,	2,	MNT_MNYBOX },		/*  3: 金庫確認				*/
};

const	unsigned short	USM_MNC_TBL2[][4] = {
							{ 0,	12,	0,	MNT_MNCNT },		/*  1: 釣銭補充				*/
							{ 0,	16,	1,	MNT_IVTRY },		/*  2: インベントリ			*/
							{ 0,	12,	2,	MNT_MNYBOX },		/*  3: 金庫確認				*/
							{ 0,	12,	3,	MNT_MNYCHG },		/*  4: 釣銭枚数				*/
							{ 0,	24,	4,	MNT_MNYPRI },		/*  5: 釣銭管理小計プリント	*/
};

const	unsigned short	USM_MNS_TBL[][4] = {
							{ 0,	12,	0,	MNT_MNYLIM },		/* 1:Limit money setting */
							{ 0,	18,	1,	MNT_MNYTIC },		/* 2:Service ticket setting */
							{ 0,	10,	2,	MNT_MNYSHP },		/* 3:Shop setting */
							{ 0,	16,	3,	MNT_MNYTAX },		/* 4:Tax setting */
							{ 0,	16,	4,	MNT_MNYKID },		/* 5:A-L kind setting */
							{ 0,	18,	5,	MNT_MNYCHA },		/* 6:Charge setting */
// MH810100(S) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)
//　MH810101 Takei(S) フェーズ2　定期対応 2021/02/16
						    	{ 0,	16,	6,	MNT_MNYTWK },		/* 7:Ticket disable week setting */
							{ 0,	12,	7,	MNT_PRISET },		/* 8:Print of the rate setting */
//  MH810101 Takei(DEL) フェーズ2　定期対応 2021/02/16	{ 0,	12,	6,	MNT_PRISET },		/* 7:Print of the rate setting */
//　MH810101 Takei(E) フェーズ2　定期対応 2021/02/16
// MH810100(E) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)
};


const	unsigned short	USM_LOG_TBL[][4] = {
							{ 0,	14,	0,	MNT_NGLOG  },		/* 1:使用カード */
							{ 0,	10,	1,	MNT_IOLOG  },		/* 2:入出庫 */
							{ 0,	18,	2,	FUSKYO_LOG },		/* 3:不正・強制出庫 */
};
const	unsigned short	MNT_STRCHK_TBL[][4] = {
							{ 0,	28,	0,	MNTLOG1_CHK },		// 1: 
};

//----------------------------------------------------------------------------------------------------------
//※他のメニューと違い、拡張機能のみ設定によりメニュー項目が可変となるためテーブルを構築しなおす
//※拡張機能メニューを増やす場合は、USM_EXT_MAX, EXTENDMENU_BASE, MENU_NUMBER, USM_EXT_TBLを一緒に増やすこと
//※USM_EXT_TBL[][2]は番号を振りなおすため意味をもたない
//----------------------------------------------------------------------------------------------------------
unsigned char	Ext_Menu_Max;									/* メニュー表示項目数（設定により可変）*/
unsigned char	USM_ExtendMENU[USM_EXT_MAX][31];				/* 拡張機能 Menu （構築用）*/
unsigned short	USM_ExtendMENU_TBL[USM_EXT_MAX][4];				/* 拡張機能 Menu TBL（構築用）*/

const	unsigned short	USM_EXT_TBL[][4] = {
// MH810100(S) Y.Yamauchi 2019/10/07 車番チケットレス(メンテナンス)
//							{ 0,	16,	0,	MNT_FTOTL },		/* :複数台数集計 */
//							{ 0,	18,	0,	MNT_CREDIT },		/* :クレジット処理 */
//							{ 0,	14,	0,	MNT_EDY },			/* :Ｅｄｙ処理 */
//							{ 0,	18,	0,	MNT_SCA },			/* :電子マネー処理 */
//							{ 0,	14,	0,	MNT_HOJIN},			/* 法人カード */
// MH810100(E) Y.Yamauchi 2019/10/07 車番チケットレス(メンテナンス)
							{ 0,	12,	0,	MNT_MTOTL },		/* :ＭＴ集計 */
							{ 0,	20,	0,	MNT_DLOCK},			/* 電磁ロック解除 */
// MH321800(S) D.Inaba ICクレジット対応
							{ 0,	18,	0,	MNT_ECR },			/* :決済リーダ処理 */
// MH321800(E) D.Inaba ICクレジット対応
// MH810104 GG119201(S) 電子ジャーナル対応
							{ 0,	18,	0,	MNT_EJ },			/* :電子ジャーナル */
// MH810104 GG119201(E) 電子ジャーナル対応
};
const	unsigned short	USM_EXTCRE_TBL[][4] = {
							{ 0,	22,	0,	MNT_CREUSE    },	/* 1:クレジット利用明細*/
							{ 0,	12,	1,	MNT_CRECONECT },	/* 2:接続確認 */
							{ 0,	24,	2,	MNT_CREUNSEND },	/* 3:未送信売上依頼データ */
							{ 0,	18,	3,	MNT_CRESALENG },	/* 4:売上拒否データ */
};

// MH321800(S) Y.Tanizaki ICクレジット対応 不要機能削除(Edy)
//const	unsigned short	USM_EXTEDY_TBL[][4] = {
//							{ 0,	20,	0,	MNT_EDY_ARM    },	/* 1:アラーム取引情報 */
//							{ 0,	20,	1,	MNT_EDY_CENT   },	/* 2:センター通信開始 */
//							{ 0,	16,	2,	MNT_EDY_SHIME  },	/* 3:締め記録情報 */
//							{ 0,	20,	3,	MNT_EDY_SHUUKEI},	/* 4:日毎集計プリント */
//							{ 0,	20,	4,	MNT_EDY_MEISAI },	/* 5:利用明細プリント */
//							{ 0,	18,	5,	MNT_EDY_TEST   },	/* 6:電文送信テスト */
//};
//
// MH321800(E) Y.Tanizaki ICクレジット対応 不要機能削除(Edy)
const	unsigned short	USM_EXTCRE_CAPPI_TBL[][4] = {
							{ 0,	22,	0,	MNT_CREUSE    },		/* 1:クレジット利用明細*/
							{ 0,	24,	1,	MNT_CREUPDATE },		/* 2:カード情報データ要求*/
};

const	unsigned short	USM_LBSET_TBL[][4] = {
							{ 0,	16,	0,	MNT_LBPAPER },		/* 1:用紙残量設定			*/
							{ 0,	26,	1,	MNT_LBPAY },		/* 2:ラベル発行不可時の設定	*/
							{ 0,	14,	2,	MNT_LBTESTP },		/* 3:テスト印字				*/
};

const	unsigned short	USM_LOCK_TBL[][4] = {
							{ 0,	28,	0,	MNT_FLAPUD 		},	/* 1.フラップ上昇下降（個別）	*/
							{ 0,	28,	1,	MNT_FLAPUD_ALL	},	/* 2.フラップ上昇下降（全て）	*/
							{ 0,	26,	2,	MNT_BIKLCK		},	/* 3.駐輪ロック開閉（個別）		*/
							{ 0,	26,	3,	MNT_BIKLCK_ALL	},	/* 4.駐輪ロック開閉（全て）		*/
};

const	unsigned short	USM_KIND_TBL[][4] = {
							{ 0,	8,	0,	MNT_CAR },		/* 1.駐車					*/
							{ 0,	8,	1,	MNT_BIK },		/* 2.駐輪					*/
};

const	unsigned short	USM_KIND3_TBL[][4] = {
							{ 0,	8,	0,	MNT_INT_CAR },	/* 1.駐車					*/
							{ 0,   14,	1,	MNT_CAR },		/* 2.駐車（IF-3000/3150）	*/
							{ 0,	8,	2,	MNT_BIK },		/* 3.駐輪					*/
};

const	unsigned short	USM_CERTI_TBL[][4] = {
							{ 0,	12,	0,	MNT_CERTI_SET },		// 設定
							{ 0,	10,	1,	MNT_CERTI_ISSU },		// 発行
};
const	char			USM_CERTI_TBL_MAX = (char)(sizeof(USM_CERTI_TBL)/sizeof(USM_CERTI_TBL[0]));

const	unsigned short	MNT_SEL_TBL[][4] = {
							{ 0,	24,	0,	USR_MNT },			/* User Maintenance */
							{ 0,	24,	1,	SYS_MNT },			/* System Maintenance */
};

const	unsigned short	CARD_ISU_TBL[][4] = {
							{ 0,	8,	0,	CARD_PASS },		/* 1:定期 */
							{ 0,	14,	1,	CARD_KKRI },		/* 2:係員カード */
};

const	unsigned short	FUNC_CNT_TBL1[][4] = {
							{ 0,	16,	0,	FCNT_FUNC },		/* 1.動作カウント 				*/
							{ 0,	28,	1,	FCNT_FLAP },		/* 2.フラップ装置動作カウント 	*/
};

const	unsigned short	FUNC_CNT_TBL2[][4] = {
							{ 0,	16,	0,	FCNT_FUNC },		/* 1.動作カウント 				*/
// MH810100(S) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)							
//							 { 0,	28,	1,	FCNT_FLAP },		/* 2.フラップ装置動作カウント 	*/
//							 { 0,	26,	2,	FCNT_ROCK },		/* 3.ロック装置動作カウント 	*/
// MH810100(E) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)							
};

const	unsigned short	MIFARE_CHK_TBL[][4] = {
							{ 0,	14,	0,	CHK_COMTST},		/* 通信テスト */
							{ 0,	24,	1,	CHK_REDLITTST},		/* リード・ライトテスト  */
							{ 0,	24,	2,	CHK_CADPECRNUMRED},	/* カード固有番号リード  */
							{ 0,	22,	3,	CHK_VERCHK},		/* バージョンチェック  */
};
const	unsigned short	CCOM_CHK_TBL[][4] = {
							{ 0,	22,	0,	CCOM_DTCLR},		/* 未送信データクリア */
							{ 0,	20,	1,	CCOM_FLSH},			/* 未送信データ送信   */
// MH810100(S) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)						
//							{ 0,	22,	2,	CCOM_TEST},			/* センター通信テスト */
//							 { 0,	26,	3,	CCOM_APN},			/* 接続先ＡＰＮ確認 */
//							 { 0,	20,	4,	CCOM_ATN},			/* 電波受信状況確認 */
//							{ 0,	22,	5,	CCOM_OIBANCLR},		/* センター追番クリア */							
//							{ 0,	24,	6,	CCOM_REMOTE_DL},	/* 遠隔メンテナンス確認 */
// MH810100(E) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)						
							{ 0,	22,	2,	CCOM_OIBANCLR},		/* センター追番クリア */							
							{ 0,	24,	3,	CCOM_REMOTE_DL},	/* 遠隔メンテナンス確認 */
// MH810100(S) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)
//// MH322917(S) A.Iiizumi 2018/09/03 長期駐車検出機能の拡張対応(検出部分)
//							 { 0,	22,	7,	CCOM_LONG_PARK_ALLREL},	/* 長期駐車全解除送信 */
//// MH322917(E) A.Iiizumi 2018/09/03 長期駐車検出機能の拡張対応(検出部分)
// MH810100(E) Y.Yamauchi 2019/10/03 車番チケットレス(メンテナンス)
};

const	unsigned short	CCOM_CHK2_TBL[][4] = {
							{ 0,	22,	0,	CCOM_APN_AMS},		/* ＡＭＳ用ＡＰＮ */
							{ 0,	22,	1,	CCOM_APN_AMN},		/* アマノ用ＡＰＮ */
							{ 0,	24,	2,	CCOM_APN_PWEB},		/* 駐車場センター用ＡＰＮ */
};

const	unsigned short	PIP_CHK_TBL[][4] = {
							{ 0,	16,	0,	PIP_DTCLR},			/* データクリア		  */
};

// MH810100(S) Y.Yamauchi 2019/10/08 車番チケットレス(メンテナンス)
const	unsigned short	QR_CHK_TBL[][4] = {
							{ 0,	14,	0,	QR_READ},		/* 読取テスト　　　 */
							{ 0,	18,	1,	QR_VER},		/* バージョン確認　*/
};
const	unsigned short	REAL_CHK_TBL[][4] = {
							{ 0,	30,	0,	UNSEND_REAL_CLEAR},		/* 未送信データクリア */
							{ 0,	30,	1,	CENTER_REAL_TEST},		/* センター通信テスト */
							{ 0,	22,	2,	REAL_OIBANCLR},			/* センター追番クリア */
};
const	unsigned short	DCNET_CHK_TBL[][4] = {
							{ 0,	30,	0,	DC_UNSEND_CLEAR},		/* 未送信データクリア */
							{ 0,	30,	1,	DC_CONNECT_TEST},		/* センター通信テスト */
							{ 0,	22,	2,	DC_OIBANCLR},			/* センター追番クリア */
};
// MH810100(E) Y.Yamauchi 2019/10/08 車番チケットレス(メンテナンス)

const	unsigned short	CRE_CHK_TBL[][4] = {
							{ 0,	20,	0,	CREDIT_UNSEND},		/* 未送信売上データ */
							{ 0,	18,	1,	CREDIT_SALENG},		/* 売上拒否データ */
};

const	unsigned short	FSUICA_CHK_TBL[][4] = {
							{ 0,	14,	0,	FISMF1_CHK },		// 1: 通信テスト
							{ 0,	20,	1,	FISMF2_CHK },		// 2: 通信ログプリント
							{ 0,	28,	2,	FISMF3_CHK },		// 3: 通信ログプリント（異常）
							{ 0,	20,	3,	MNT_SCA_SHUUKEI},	/* 4: 日毎集計プリント */
							{ 0,	20,	4,	MNT_SCA_MEISAI },	/* 5: 利用明細プリント */
};
const	unsigned short	FSUICA_CHK_TBL2[][4] = {
							{ 0,	28,	0,	MNT_SUICALOG_INJI },		// 1: 通信ログプリント(全ログ) 
							{ 0,	30,	1,	MNT_SUICALOG_INJI2 },		// 2: 通信ログプリント(直近ログ)
};

// MH321800(S) D.Inaba ICクレジット対応(決済リーダチェック追加)
const	unsigned short	FECR_CHK_TBL[][4] = {
							{ 0,	14,	0,	FISMF1_CHK },		// 1: 通信テスト
							{ 0,	20,	1,	FISMF2_CHK },		// 2: 通信ログプリント
							{ 0,	28,	2,	FISMF3_CHK },		// 3: 通信ログプリント（異常）
							{ 0,	20,	3,	ECR_BRAND_COND},    // 4: ブランド状態確認
							{ 0,	22,	4,	ECR_MNT    },		// 5: リーダメンテナンス
};
// MH321800(E) D.Inaba ICクレジット対応(決済リーダチェック追加)

// MH321800(S) Y.Tanizaki ICクレジット対応 不要機能削除(Edy)
//const	unsigned short	FEDY_CHK_TBL[][4] = {
//							{ 0,	14,	0,	FEDY1_CHK },		// 1: ＵＩテスト
//							{ 0,	22,	1,	FEDY2_CHK },		// 2: カードリードテスト
//							{ 0,	28,	2,	FEDY3_CHK },		// 3: 設定＆ステータスプリント
//							{ 0,	16,	3,	FEDY4_CHK },		// 4: 初回通信実行
//							{ 0,	22,	4,	FEDY5_CHK },		// 5: 耐タンパーチェック
//							{ 0,	20,	5,	MNT_EDY_SHUUKEI},	// 6: 日毎集計プリント
//							{ 0,	20,	6,	MNT_EDY_MEISAI },	// 7: 利用明細プリント
//};
// MH321800(E) Y.Tanizaki ICクレジット対応 不要機能削除(Edy)

const	unsigned short	USM_EXTSCA_TBL[][4] = {
							{ 0,	20,	0,	MNT_SCA_SHUUKEI},	/* 1:日毎集計プリント */
							{ 0,	20,	1,	MNT_SCA_MEISAI },	/* 2:利用明細プリント */
};

// MH321800(S) D.Inaba ICクレジット対応 (決済リーダ処理メニュー)
const	unsigned short	USM_EXTEC_TBL[][4] = {
							{ 0,	20,	0,	MNT_ECR_SHUUKEI},			/* 1:日毎集計プリント	*/
							{ 0,	20,	1,	MNT_ECR_MEISAI },			/* 2:利用明細プリント	*/
							{ 0,	20,	2,	MNT_ECR_ALARM_LOG},			/* 3:処理未了取引記録	*/
// MH810103 MHUT40XX(S) みなし決済の集計を新規に設ける
							{ 0,	22,	3,	MNT_ECR_MINASHI},			/* 4:みなし決済プリント	*/
// MH810103 MHUT40XX(E) みなし決済の集計を新規に設ける
};
// MH321800(E) D.Inaba ICクレジット対応 (決済リーダ処理メニュー)

const	unsigned short	FUNC_FLP_TBL[][4] = {
							{ 0,   16,	0,	MNT_FLP_LOOP_DATA_CHK },	/* 1.ループデータ			*/
							{ 0,   24,	1,	MNT_FLP_SENSOR_CTRL },		/* 2.車両検知センサー操作	*/
};
const	unsigned short	FUNC_CRR_TBL[][4] = {
							{ 0,   28,	0,	MNT_CRR_VER },				/* 1.ＣＲＲバージョンチェック	*/
							{ 0,   28,	1,	MNT_CRR_TST },				/* 2.ＣＲＲ折り返し工場テスト	*/
};

const	unsigned short	FUNC_MAFCHK_TBL[][4] = {
							{ 0,   24,	0,	MNT_MAF_RISM_COMCHK },	/* １．Rismサーバー接続確認 */
							{ 0,   22,	1,	MNT_WCARD_INF },		/* ２．カード追加設定情報　 */
							{ 0,   28,	2,	MNT_PARAM_LOG},			/* ３．料金設定通信ログプリント */
};                                                          
const	unsigned short	FUNC_CAPPICHK_TBL[][4] = {
							{ 0,   16,	0,	MNT_CAPPI_RESET },		/* １．追番リセット　　　　	*/
							{ 0,   25,	1,	MNT_CAPPI_COMCHK },		/* ２．Cappiサーバー接続確認 */
};

const	unsigned short	FUNC_FTPCONNECTCHK_TBL[][4] = {
							{ 0,   12,	0,	FTP_CONNECT_FUNC },	/* １．接続確認			*/
							{ 0,   26,	1,	FTP_PARAM_UPL },	/* ２．パラメータアップロード		*/
};

// MH810104 GG119201(S) 電子ジャーナル対応
const	unsigned short	USM_EXTEJ_TBL[][4] = {
							{ 0,	20,	0,	MNT_EJ_SD_INF},				/* １．ＳＤカード情報	*/
};
// MH810104 GG119201(E) 電子ジャーナル対応

char	DP_CP[2];							/* 0:Cursor Possion ( 0～2 )				*/
											/* 1:Item № displayed in the first line	*/

short	gCurSrtPara;	// 車室分類（駐車/駐輪）

// 券ﾃﾞｰﾀ表示用
union	CrDspRec	cr_dsp;

// 操作ログ登録用
ushort	OpelogNo;
ushort	OpelogNo2;
uchar	MovCntClr;			// 動作ｶｳﾝﾄｸﾘｱ実行有無（OFF=実行無／ON=有）

// 設定FLASH書き換え用
ushort	SetChange;

unsigned char	*fck_chk_adr;		// ﾁｪｯｸﾒﾓﾘｰｱﾄﾞﾚｽ（内部ＲＡＭﾒﾓﾘｰﾁｪｯｸ用）
unsigned char	fck_chk_err;		// ﾁｪｯｸ結果		（内部ＲＡＭﾒﾓﾘｰﾁｪｯｸ用）
unsigned char	fck_sav_data;		// ﾃﾞｰﾀ退避ｴﾘｱ	（内部ＲＡＭﾒﾓﾘｰﾁｪｯｸ用）
unsigned char	fck_chk_data1;		// ﾁｪｯｸﾃﾞｰﾀ１	（内部ＲＡＭﾒﾓﾘｰﾁｪｯｸ用）
unsigned char	fck_chk_data2;		// ﾁｪｯｸﾃﾞｰﾀ２	（内部ＲＡＭﾒﾓﾘｰﾁｪｯｸ用）

// 技術者権限では設定禁止とするアドレスを指定
const	PRM_MASK param_mask[] = {
// MH810100(S) K.Onodera 2019/12/03 車番チケットレス（設定見直し）
//	{10005,10010},{10014,10038},{10042,10045},{10048,10050},{10052,10052},{10057,10059},{10064,10064},{10069,10069},{10073,10100},
//	{20001,20001},{20003,20009},{20015,20015},{20018,20020},{20022,20023},{20026,20026},{20035,20038},{20040,20040},{20044,20100},
//// MH322914(S) K.Onodera 2016/12/07 下降ロック状態で出庫した場合、設定にてフラップ下降をリトライする[共通バグNo.1336](GW872707)
////	{30001,30041},{30046,30046},{30048,30061},{30064,30067},{30070,30079},{30081,30081},{30083,30096},{30098,30098},{30101,30117},{30119,30120},{30123,30132},{30134,30150},
//// MH322916(S) A.Iiizumi 2018/05/16 長期駐車検出機能対応
////	{30001,30041},{30046,30046},{30048,30061},{30064,30067},{30070,30079},{30081,30081},{30083,30096},{30098,30098},{30101,30117},{30120,30120},{30123,30132},{30134,30150},
//// MH322917(S) A.Iiizumi 2018/09/03 長期駐車検出機能の拡張対応(検出部分)
////	{30001,30041},{30046,30046},{30048,30061},{30064,30067},{30070,30079},{30081,30081},{30083,30096},{30098,30098},{30101,30117},{30120,30120},{30123,30132},{30134,30134},{30136,30150},
//	{30001,30041},{30046,30046},{30048,30061},{30064,30067},{30070,30071},{30073,30079},{30081,30081},{30083,30096},{30098,30098},{30101,30117},{30120,30120},{30123,30132},{30134,30134},{30137,30150},
//// MH322917(E) A.Iiizumi 2018/09/03 長期駐車検出機能の拡張対応(検出部分)
//// MH322916(E) A.Iiizumi 2018/05/16 長期駐車検出機能対応
//// MH322914(E) K.Onodera 2016/12/07 下降ロック状態で出庫した場合、設定にてフラップ下降をリトライする[共通バグNo.1336](GW872707)
// MH810100(S) Y.Yoshida 2020/06/04 車番チケットレス(#4109 マスク項目が共通パラメータ仕様書と異なっている)
//	{10005,10012},{10014,10039},{10042,10045},{10048,10050},{10052,10052},{10057,10059},{10064,10064},{10069,10070},{10073,10074},{10079,10100},
// MH810105(S) MH364301 インボイス対応
//	{10005,10012},{10014,10039},{10042,10045},{10048,10050},{10052,10052},{10057,10059},{10064,10064},{10069,10069},{10072,10074},{10079,10100},
// GG124100(S) R.Endo 2022/08/22 車番チケットレス3.0 #6343 クラウド料金計算対応
// 	{10005,10012},{10014,10015},{10017,10039},{10042,10045},{10048,10050},{10052,10052},{10057,10059},{10064,10064},{10069,10069},{10072,10074},{10079,10100},
	{10005,10012},{10014,10015},{10017,10039},{10042,10045},{10048,10050},{10052,10052},{10057,10059},{10061,10064},{10069,10069},{10072,10074},{10079,10100},
// GG124100(E) R.Endo 2022/08/22 車番チケットレス3.0 #6343 クラウド料金計算対応
// MH810105(E) MH364301 インボイス対応
// MH810100(E) Y.Yoshida 2020/06/04 車番チケットレス(#4109 マスク項目が共通パラメータ仕様書と異なっている)
// MH810100(S) K.Onodera 2020/03/27 車番チケットレス(#4094 マスク項目が共通パラメータ仕様書と異なっている)
//	{20001,20015},{20018,20020},{20022,20023},{20026,20026},{20035,20038},{20040,20100},
//	{30001,30067},{30069,30150},

// GG129000(S) D.Inaba 2023/09/21 ゲート式車番チケットレスシステム対応（詳細設計#5373：新レシートプリンタ対応）
///	{20001,20001},{20003,20015},{20018,20020},{20022,20023},{20026,20026},{20033,20038},{20040,20100},
	{20001,20001},{20003,20015},{20018,20020},{20023,20023},{20026,20026},{20033,20038},{20040,20100},
// GG129000(E) D.Inaba 2023/09/21 ゲート式車番チケットレスシステム対応（詳細設計#5373：新レシートプリンタ対応）

// MH810103(S) R.Endo 2021/06/03 車番チケットレス フェーズ2.2 #5692 精算完了案内タイマー設定のマスクを外す
//	{30001,30150},
// GG129000(S) 富士急ハイランド機能改善（精算完了時の画面表示を追加する）（GM803003流用）
//	{30001,30127},{30129,30150},
	{30001,30127},{30130,30150},
// GG129000(E) 富士急ハイランド機能改善（精算完了時の画面表示を追加する）（GM803003流用）
// MH810103(E) R.Endo 2021/06/03 車番チケットレス フェーズ2.2 #5692 精算完了案内タイマー設定のマスクを外す
// MH810100(E) K.Onodera 2020/03/27 車番チケットレス(#4094 マスク項目が共通パラメータ仕様書と異なっている)
// MH810100(E) K.Onodera 2019/12/03 車番チケットレス（設定見直し）

	{40007,40008},{40040,40040},{40048,40048},{40068,40080},

// MH810100(S) K.Onodera 2020/03/27 車番チケットレス(#4094 マスク項目が共通パラメータ仕様書と異なっている)
//// MH322914 (s) kasiyama 2016/07/12 GT7000に合わせて期限切れ間近案内を可変日数とする(共通改善No.1212)(MH341106)
////	{50001,50008},{50011,50011},{50013,50030},
//	{50001,50008},{50011,50011},{50014,50030},
//// MH322914 (e) kasiyama 2016/07/12 GT7000に合わせて期限切れ間近案内を可変日数とする(共通改善No.1212)(MH341106)


//　MH810101 Takei(S) フェーズ2　定期対応 2021/02/15
//	{50009,50030},
	{50001,50011},{50014,50030},
//　MH810101 Takei(E) フェーズ2　定期対応 2021/02/15
	
// MH810100(E) K.Onodera 2020/03/27 車番チケットレス(#4094 マスク項目が共通パラメータ仕様書と異なっている)

// MH810100(S) Y.Yoshida 2020/06/04 車番チケットレス(#4109 マスク項目が共通パラメータ仕様書と異なっている)
//	{60005,60006},{60011,60012},{60017,60018},{60023,60024},{60029,60030},{60035,60036},{60041,60042},{60047,60048},{60053,60054},{60059,60060},
//	{60065,60066},{60071,60075},
	{60002,60002},{60005,60006},{60008,60008},{60011,60012},{60014,60014},{60017,60018},{60020,60020},{60023,60024},{60026,60026},{60029,60030},
	{60032,60032},{60035,60036},{60038,60038},{60041,60042},{60044,60044},{60047,60048},{60050,60050},{60053,60054},{60056,60056},{60059,60060},
	{60062,60062},{60065,60066},{60068,60068},{60071,60075},
// MH810100(E) Y.Yoshida 2020/06/04 車番チケットレス(#4109 マスク項目が共通パラメータ仕様書と異なっている)

// MH810100(S) K.Onodera 2019/12/03 車番チケットレス（設定見直し）
//	{70003,70003},{70008,70008},{70013,70013},{70018,70018},{70023,70023},{70028,70028},{70033,70033},{70038,70038},{70043,70043},{70048,70048},
//	{70053,70053},{70058,70058},{70063,70063},{70068,70068},{70073,70073},{70078,70078},{70083,70083},{70088,70088},{70093,70093},{70098,70098},
//	{70103,70103},{70108,70108},{70113,70113},{70118,70118},{70123,70123},{70128,70128},{70133,70133},{70138,70138},{70143,70143},{70148,70148},
// MH810100(S) Y.Yoshida 2020/06/04 車番チケットレス(#4109 マスク項目が共通パラメータ仕様書と異なっている)
//	{70003,70004},{70008,70008},{70013,70014},{70018,70018},{70023,70024},{70028,70028},{70033,70034},{70038,70038},{70043,70044},{70048,70048},
//	{70053,70054},{70058,70058},{70063,70064},{70068,70068},{70073,70074},{70078,70078},{70083,70084},{70088,70088},{70093,70094},{70098,70098},
//	{70103,70104},{70108,70108},{70113,70114},{70118,70118},{70123,70124},{70128,70128},{70133,70134},{70138,70138},{70143,70144},{70148,70148},
	{70002,70004},{70008,70008},{70012,70014},{70018,70018},{70022,70024},{70028,70028},{70032,70034},{70038,70038},{70042,70044},{70048,70048},
	{70052,70054},{70058,70058},{70062,70064},{70068,70068},{70072,70074},{70078,70078},{70082,70084},{70088,70088},{70092,70094},{70098,70098},
	{70102,70104},{70108,70108},{70112,70114},{70118,70118},{70122,70124},{70128,70128},{70132,70134},{70138,70138},{70142,70144},{70148,70148},
// MH810100(E) Y.Yoshida 2020/06/04 車番チケットレス(#4109 マスク項目が共通パラメータ仕様書と異なっている)
// MH810100(E) K.Onodera 2019/12/03 車番チケットレス（設定見直し）

// MH810100(S) K.Onodera 2019/12/03 車番チケットレス（設定見直し）
//	{80003,80004},{80006,80007},{80026,80027},
	{80002,80004},{80006,80007},{80026,80027},
// MH810100(E) K.Onodera 2019/12/03 車番チケットレス（設定見直し）

	{90046,90075},{90111,90140},

// MH810104(S) R.Endo 2021/08/18 車番チケットレス フェーズ2.3 #5792 多店舗割引対応(多店舗割引設定のマスク解除)
//	{110001,110186},
// MH810104(E) R.Endo 2021/08/18 車番チケットレス フェーズ2.3 #5792 多店舗割引対応(多店舗割引設定のマスク解除)

	{120001,120301},

// MH810100(S) K.Onodera 2019/12/03 車番チケットレス（設定見直し）
//// MH322914 (s) kasiyama 2016/07/12 GT7000に合わせて期限切れ間近案内を可変日数とする(共通改善No.1212)(MH341106)回数券期限切れ予告
////	{130012,130015},
//	{130012,130023},
//// MH322914 (e) kasiyama 2016/07/12 GT7000に合わせて期限切れ間近案内を可変日数とする(共通改善No.1212)(MH341106)回数券期限切れ予告
	{130001,130024},
// MH810100(E) K.Onodera 2019/12/03 車番チケットレス（設定見直し）

// MH810105(S) MH364301 QRコード決済対応
//// MH810100(S) K.Onodera 2019/12/03 車番チケットレス（設定見直し）
////	{140002,140004},{140007,140007},{140011,140011},{140013,140013},{140015,140015},{140018,140025},
//	{140002,140004},{140007,140007},{140011,140011},{140013,140015},{140018,140025},
//// MH810100(E) K.Onodera 2019/12/03 車番チケットレス（設定見直し）
	{140002,140004},{140011,140011},{140013,140015},{140018,140025},
// MH810105(E) MH364301 QRコード決済対応

	{160051,160051},{160055,160058},{160060,160060},

// GG129000(S) M.Fujikawa 2023/09/28 ゲート式車番チケットレスシステム対応　QR駐車券のパラメータ設定
//	{170003,170003},{170054,170060},
// GG129004(S) R.Endo 2024/11/19 電子領収証対応
// 	{170003,170003},{170054,170055},{170058,170060},
	{170003,170003},{170054,170055},{170059,170060},
// GG129004(E) R.Endo 2024/11/19 電子領収証対応
// GG129000(E) M.Fujikawa 2023/09/28 ゲート式車番チケットレスシステム対応　QR駐車券のパラメータ設定

// MH810100(S) K.Onodera 2019/12/03 車番チケットレス（設定見直し）
//// MH322914 (S) S.Fujii 2017/03/30 AI-V対応
////	{180013,180013},{180030,180034},{180040,180050},
//// MH322917(S) A.Iiizumi 2018/09/03 長期駐車検出機能の拡張対応(検出部分)
////	{180013,180013},{180030,180034},{180040,180050},{180061,180065},{180071,180100},
//	{180013,180013},{180030,180032},{180034,180034},{180040,180050},{180061,180065},{180071,180100},
//// MH322917(E) A.Iiizumi 2018/09/03 長期駐車検出機能の拡張対応(検出部分)
//// MH322914 (E) S.Fujii 2017/03/30 AI-V対応
// MH810100(S) Y.Yoshida 2020/06/04 車番チケットレス(#4109 マスク項目が共通パラメータ仕様書と異なっている)
//	{180013,180013},{180016,180017},{180030,180034},{180040,180050},{180061,180065},{180071,180100},
// MH810105(S) MH364301 インボイス対応
//	{180013,180013},{180016,180017},{180030,180034},{180040,180065},{180071,180100},
	{180013,180013},{180016,180017},{180030,180034},{180040,180065},{180079,180100},
// MH810105(E) MH364301 インボイス対応
// MH810100(E) Y.Yoshida 2020/06/04 車番チケットレス(#4109 マスク項目が共通パラメータ仕様書と異なっている)
// MH810100(E) K.Onodera 2019/12/03 車番チケットレス（設定見直し）	

	{190001,190006},{190017,190027},{190029,190030},

	{200005,200008},{200011,200014},{200017,200020},{200023,200026},{200028,200029},{200031,200032},{200034,200052},{200054,200055},{200057,200065},

	{210015,210032},

	{220002,220013},

	{230001,230030},

// MH810100(S) K.Onodera 2019/12/03 車番チケットレス（設定見直し）
//	{240002,240003},{240005,240017},{240019,240019},{240021,240029},{240036,240040},
	{240001,240040},
// MH810100(E) K.Onodera 2019/12/03 車番チケットレス（設定見直し）

// MH810100(S) Y.Yoshida 2020/06/04 車番チケットレス(#4109 マスク項目が共通パラメータ仕様書と異なっている)
	{250397,250400},
// MH810100(E) Y.Yoshida 2020/06/04 車番チケットレス(#4109 マスク項目が共通パラメータ仕様書と異なっている)

// MH810104 GG119201(S) 電子ジャーナル対応
//	{260001,260005},
	{260002,260002},{260006,260020},
// MH810104 GG119201(E) 電子ジャーナル対応

// MH810100(S) S.Fujii 2020/06/25 車番チケットレス(#4109 マスク項目が共通パラメータ仕様書と異なっている)
	{270021,270100},
// MH810100(E) S.Fujii 2020/06/25 車番チケットレス(#4109 マスク項目が共通パラメータ仕様書と異なっている)

// GG124100(S) R.Endo 2022/08/22 車番チケットレス3.0 #6343 クラウド料金計算対応
// 	{280003,280010},{280012,280014},{280018,280018},{280021,280021},{280029,280029},{280031,280034},{280036,280037},{280040,280040},{280042,280055},
	{280003,280010},{280012,280014},{280018,280018},{280021,280021},{280028,280029},{280031,280034},{280036,280037},{280040,280040},{280042,280055},
// GG124100(E) R.Endo 2022/08/22 車番チケットレス3.0 #6343 クラウド料金計算対応

// MH810100(S) K.Onodera 2019/12/03 車番チケットレス（設定見直し）
//	{300091,300150},
// MH810102(S) R.Endo 2021/04/16 車番チケットレス フェーズ2.5 #5509 時間帯定期関連設定値のマスクを外す
//	{300001,300150},
// MH810102(E) R.Endo 2021/04/16 車番チケットレス フェーズ2.5 #5509 時間帯定期関連設定値のマスクを外す
// MH810100(E) K.Onodera 2019/12/03 車番チケットレス（設定見直し）

	{320001,320240},

	{330001,330100},

// MH810100(S) K.Onodera 2020/03/27 車番チケットレス(#4094 マスク項目が共通パラメータ仕様書と異なっている)
//	{340001,340024},{340027,340036},{340038,340060},{340069,340069},{340119,340119},{340123,340150},
// MH810100(S) Y.Yoshida 2020/06/04 車番チケットレス(#4109 マスク項目が共通パラメータ仕様書と異なっている)
//	{340001,340024},{340027,340036},{340038,340060},{340069,340094},{340119,340120},{340123,340150},
	{340001,340024},{340027,340036},{340038,340060},{340069,340094},{340119,340121},{340123,340150},
// MH810100(E) Y.Yoshida 2020/06/04 車番チケットレス(#4109 マスク項目が共通パラメータ仕様書と異なっている)
// MH810100(E) K.Onodera 2020/03/27 車番チケットレス(#4094 マスク項目が共通パラメータ仕様書と異なっている)

// MH810100(S) S.Fujii 2020/06/23 車番チケットレス（電子決済端末対応）
//	{350001,350005},{350008,350010},{350012,350099},
	{350001,350100},
// MH810100(E) S.Fujii 2020/06/23 車番チケットレス（電子決済端末対応）

// MH810100(S) K.Onodera 2019/12/03 車番チケットレス（設定見直し）
//// MH322914(S) K.Onodera 2017/02/03 通信手順デフォルト変更[共通バグNo.1353]
////// 仕様変更(S) K.Onodera 2016/11/04 振替精算時の領収証自動発行の設定を設ける
//////	{360001,360011},{360013,360031},{360033,360050},{360055,360061},{360077,360078},{360097,360100},
////	{360001,360011},{360013,360031},{360035,360039},{360041,360050},{360055,360061},{360077,360078},{360097,360100},
////// 仕様変更(E) K.Onodera 2016/11/04 振替精算時の領収証自動発行の設定を設ける
//// MH322917(S) A.Iiizumi 2018/08/30 リアルタイム情報 フォーマットRev11対応
////	{360001,360011},{360013,360031},{360035,360039},{360041,360044},{360046,360050},{360055,360061},{360077,360077},{360097,360100},
//	{360001,360011},{360013,360031},{360035,360039},{360041,360044},{360046,360050},{360055,360061},{360077,360077},{360098,360100},
//// MH322917(E) A.Iiizumi 2018/08/30 リアルタイム情報 フォーマットRev11対応
//// MH322914(E) K.Onodera 2017/02/03 通信手順デフォルト変更[共通バグNo.1353]
// MH810100(S) Y.Yoshida 2020/06/04 車番チケットレス(#4109 マスク項目が共通パラメータ仕様書と異なっている)
//	{360001,360011},{360013,360031},{360035,360039},{360041,360044},{360046,360050},{360052,360061},{360074,360074},{360077,360077},{360079,360095},{360098,360100},
	{360001,360011},{360013,360033},{360035,360039},{360041,360044},{360046,360050},{360052,360061},{360065,360066},{360074,360074},{360077,360077},{360079,360095},{360098,360100},
// MH810100(E) Y.Yoshida 2020/06/04 車番チケットレス(#4109 マスク項目が共通パラメータ仕様書と異なっている)
// MH810100(E) K.Onodera 2019/12/03 車番チケットレス（設定見直し）

	{370001,370100},

// MH810100(S) K.Onodera 2019/12/03 車番チケットレス（設定見直し）
//	{380001,380001},{380004,380004},{380006,380020},{380027,380064},{380068,380100},
// MH810100(S) S.Fujii 2020/06/23 車番チケットレス（電子決済端末対応）
//	{380001,380100},
	{380001,380001},{380004,380100},
// MH810100(E) S.Fujii 2020/06/23 車番チケットレス（電子決済端末対応）
// MH810100(E) K.Onodera 2019/12/03 車番チケットレス（設定見直し）
	{390001,390200},

	{400001,400100},

	{410008,410092},{410095,410100},

	{420001,420100},

	{430001,430010},

	{440001,440010},

	{450001,450050},

// MH810100(S) K.Onodera 2019/12/03 車番チケットレス（設定見直し）
//	{460003,460010},{460023,460030},{460043,460050},{460063,460070},{460075,460200},
// MH810100(S) Y.Yoshida 2020/06/04 車番チケットレス(#4109 マスク項目が共通パラメータ仕様書と異なっている)
//	{460003,460070},{460075,460200},
	{460001,460200},
// MH810100(E) Y.Yoshida 2020/06/04 車番チケットレス(#4109 マスク項目が共通パラメータ仕様書と異なっている)
// MH810100(E) K.Onodera 2019/12/03 車番チケットレス（設定見直し）

	{470001,470100},

// MH810100(S) K.Onodera 2019/11/26 車番チケットレス（設定見直し）
//	{480001,480100},
// MH810100(S) Y.Yoshida 2020/06/04 車番チケットレス(#4109 マスク項目が共通パラメータ仕様書と異なっている)
//	{480006,480006},{480008,480009},{480018,480019},{480026,480029},{480031,480100},
	{480006,480006},{480008,480009},{480018,480019},{480026,480100},
// MH810100(E) Y.Yoshida 2020/06/04 車番チケットレス(#4109 マスク項目が共通パラメータ仕様書と異なっている)
// MH810100(E) K.Onodera 2019/11/26 車番チケットレス（設定見直し）

// GG120600(S) // Phase9 #6186 技術員操作でパラメータのセクション49を変更することができない
//	{490001,490100},
	{490011,490100},
// GG120600(E) // Phase9 #6186 技術員操作でパラメータのセクション49を変更することができない

// MH321800(S) D.Inaba ICクレジット対応
//	{500001,500100},
// MH810103 GG119202(S) みなし決済扱い時の動作
//	{500005,500005},{500008,500009},{500014,500019},{500029,500100},
// MH810103 GG119202(S) 電子マネー決済時の決済結果受信待ちタイマ追加
//	{500005,500005},{500008,500009},{500016,500019},{500029,500100},
// MH810103 MHUT40XX(S) Edy・WAON対応
//	{500005,500005},{500008,500009},{500017,500019},{500029,500100},
// MH810105 GG119202(S) T合計連動印字対応
//	{500005,500005},{500007,500009},{500017,500026},{500029,500040},{500046,500100},
// MH810105(S) MH364301 QRコード決済対応
//	{500007,500009},{500017,500026},{500029,500040},{500046,500100},
	{500007,500009},{500017,500026},{500029,500040},{500048,500049},{500053,500100},
// MH810105(E) MH364301 QRコード決済対応
// MH810105 GG119202(S) T合計連動印字対応
// MH810103 MHUT40XX(E) Edy・WAON対応
// MH810103 GG119202(E) 電子マネー決済時の決済結果受信待ちタイマ追加
// MH810103 GG119202(E) みなし決済扱い時の動作
// MH321800(E) D.Inaba ICクレジット対応

	{510001,520020},

	{520001,520050},

	{530001,530100},

	{540001,540100},

	{550001,550100},

	{560006,560019},{560044,560100},

// MH810100(S) K.Onodera 2019/11/26 車番チケットレス（設定見直し）
//	{570181,570300},
// MH810102(S) R.Endo 2021/04/16 車番チケットレス フェーズ2.5 #5509 時間帯定期関連設定値のマスクを外す
//	{570001,570300},
// MH810102(E) R.Endo 2021/04/16 車番チケットレス フェーズ2.5 #5509 時間帯定期関連設定値のマスクを外す
// MH810100(E) K.Onodera 2019/11/26 車番チケットレス（設定見直し）

	{580028,580060},{580328,580360},{580628,580660},

	{590028,590060},{590328,590360},{590628,590660},

// MH810100(S) K.Onodera 2020/01/21 車番チケットレス（LCD設定）
//	{600001,600100},
	{600001,600010},{600016,600016},{600028,600029},{600034,600035},{600039,600039},{600042,600042},{600044,600050},
	{600056,600056},{600058,600059},{600064,600064},{600067,600079},
// MH810105(S) MH364301 QRコード決済対応 #6430 休業案内表示の仕様変更(休業案内に問い合わせ先表示する)対応
//// MH810100(S) K.Onodera 2020/03/27 車番チケットレス(#4094 マスク項目が共通パラメータ仕様書と異なっている)
////	{600082,600089},{600091,600100},{600107,600110},{600112,600113},{600118,600120},
////	{600121,600125},{600127,600127},{600139,600140},{600144,600150},{600161,600170},{600185,600200},
//// MH810100(S) S.Nishimoto 2020/08/27 車番チケットレス(#4766 初期画面 「出場済みの車両を精算」ボタンを共通パラメータで切り替え可能としてほしい)
////	{600082,600089},{600092,600100},{600108,600110},{600112,600113},{600118,600120},
//// MH810104(S) R.Endo 2021/09/30 車番チケットレス フェーズ2.3 #5997 未精算用精算促進メッセージが表示された後、「領収書」ボタンに続けて「はい」ボタンを押すとエラーメッセージが表示され精算ができない。
//// 	{600082,600089},{600092,600100},{600108,600110},{600113,600113},{600118,600120},
//	{600082,600089},{600092,600100},{600108,600110},{600113,600113},{600119,600120},
//// MH810104(E) R.Endo 2021/09/30 車番チケットレス フェーズ2.3 #5997 未精算用精算促進メッセージが表示された後、「領収書」ボタンに続けて「はい」ボタンを押すとエラーメッセージが表示され精算ができない。
//// MH810100(E) S.Nishimoto 2020/08/27 車番チケットレス(#4766 初期画面 「出場済みの車両を精算」ボタンを共通パラメータで切り替え可能としてほしい)
// GG124100(S) W.Hoshino 2022/07/25 車番チケットレス フェーズ3.0 #6410 通信不良時メッセージを共通パラメータの設定により変更したい
// 	{600082,600089},{600092,600092},{600094,600100},{600108,600110},{600113,600113},
// GG129000(S) R.Endo 2022/11/10 車番チケットレス4.0 #6678 カラーLCD メモリーリーク(追加対応) [共通改善項目 No1544]
// 	{600082,600089},{600092,600092},{600094,600100},{600108,600110},
// GG129000(S) H.Fujinaga 2023/01/26 ゲート式車番チケットレスシステム対応（接客案内対応）
//	{600082,600089},{600094,600100},{600108,600110},
// MH810107(S) R.Endo 2023/09/27 #7138 新パネル対応
// 	{600082,600089},{600095,600100},{600108,600110},
// GG129004(S) M.Fujikawa 2024/10/31 待機画面の表示文言を変更する
//	{600082,600089},{600095,600100},{600108,600109},
// GG129004(S) R.Endo 2024/12/04 電子領収証対応（QRコード発行案内表示タイマー）
// 	{600082,600089},{600096,600100},{600108,600109},
// GG132000(S) 料金精算の表示文言を変更する
//	{600082,600089},{600097,600100},{600108,600109},
	{600082,600089},{600098,600100},{600108,600109},
// GG132000(E) 料金精算の表示文言を変更する
// GG129004(E) R.Endo 2024/12/04 電子領収証対応（QRコード発行案内表示タイマー）
// GG129004(E) M.Fujikawa 2024/10/31 待機画面の表示文言を変更する
// MH810107(E) R.Endo 2023/09/27 #7138 新パネル対応
// GG129000(E) H.Fujinaga 2023/01/26 ゲート式車番チケットレスシステム対応（接客案内対応）
// GG129000(E) R.Endo 2022/11/10 車番チケットレス4.0 #6678 カラーLCD メモリーリーク(追加対応) [共通改善項目 No1544]
// GG124100(E) W.Hoshino 2022/07/25 車番チケットレス フェーズ3.0 #6410 通信不良時メッセージを共通パラメータの設定により変更したい
// MH810105(E) MH364301 QRコード決済対応 #6430 休業案内表示の仕様変更(休業案内に問い合わせ先表示する)対応
// MH810100(S) S.Nishimoto 2020/09/04 車番チケットレス(未使用設定の追加)
//	{600121,600125},{600127,600127},{600139,600140},{600141,600200},
// GG129000(S) H.Fujinaga 2022/12/05 ゲート式車番チケットレスシステム対応（QR駐車券対応）
//	{600121,600125},{600127,600127},{600136,600137},{600139,600140},{600141,600200},
// GG129000(S) M.Fujikawa 2023/09/28 ゲート式車番チケットレスシステム対応　QR駐車券のパラメータ設定
//	{600121,600125},{600127,600127},{600136,600137},{600141,600200},
	{600121,600125},{600127,600127},{600136,600137},{600139,600139},{600141,600200},
// GG129000(E) M.Fujikawa 2023/09/28 ゲート式車番チケットレスシステム対応　QR駐車券のパラメータ設定
// GG129000(E) H.Fujinaga 2022/12/05 ゲート式車番チケットレスシステム対応（QR駐車券対応）
// MH810100(E) S.Nishimoto 2020/09/04 車番チケットレス(未使用設定の追加)
// MH810100(E) K.Onodera 2020/03/27 車番チケットレス(#4094 マスク項目が共通パラメータ仕様書と異なっている)
// MH810100(E) K.Onodera 2020/01/21 車番チケットレス（LCD設定）
// MH810104(S) R.Endo 2021/09/25 車番チケットレス フェーズ2.3 #6014 QRフォーマットパターン設定のマスクを外す
	{600202,600208},{600210,600210},{600227,600230},{600252,600252},{600269,600290},{600292,600292},{600294,600294},{600298,600298},{600300,600300},{600304,600304},{600306,600306},{600310,600340},{600368,600400},
	{600402,600408},{600410,600410},{600427,600430},{600452,600452},{600469,600490},{600492,600492},{600494,600494},{600498,600498},{600500,600500},{600504,600504},{600506,600506},{600510,600540},{600568,600600},
	{600602,600608},{600610,600610},{600627,600630},{600652,600652},{600669,600690},{600692,600692},{600694,600694},{600698,600698},{600700,600700},{600704,600704},{600706,600706},{600710,600740},{600768,600800},
// MH810104(E) R.Endo 2021/09/25 車番チケットレス フェーズ2.3 #6014 QRフォーマットパターン設定のマスクを外す
};

const	PRM_MASK param_mask31_0[] = {
	//昼夜帯
	{310901,310901},
};

const	PRM_MASK param_mask31_1[] = {
	//逓減帯
	{310896,310900},
};

const	short	prm_mask_max = (sizeof(param_mask) / sizeof(PRM_MASK));	// マスクデータ件数
const	short	prm_mask31_0_max = (sizeof(param_mask31_0) / sizeof(PRM_MASK));	// マスクデータ件数：昼夜帯
const	short	prm_mask31_1_max = (sizeof(param_mask31_1) / sizeof(PRM_MASK));	// マスクデータ件数：逓減帯
/*--------------------------------------------------------------------------*/
/*	Common function of Maintenance											*/
/*--------------------------------------------------------------------------*/

/* Role of Short Cut Key to Function Key *///＠
unsigned short	StoF( unsigned short keyid, char mode ){

	unsigned short	sw;
	sw = keyid;
	return sw;
}

/*[]----------------------------------------------------------------------[]*/
/*| Menu Select                                                            |*/
/*[]----------------------------------------------------------------------[]*/
/*| MODULE NAME  : Menu_Slt                                                |*/
/*| PARAMETER    :                                                         |*/
/*| RETURN VALUE : short    ret;    0x00fe : F5 Key ( End Key )            |*/
/*|                                 0x00fe : Maintenance KEY               |*/
/*[]----------------------------------------------------------------------[]*/
/*| Author       : B.Miyamoto                                              |*/
/*| Date         : 2002-10-04                                              |*/
/*| Update       : Y.Tanaka 2005-04-04                                     |*/
/*|              : ART:ogura 2005-07-12 F3によりﾍﾟｰｼﾞ切換                  |*/
/*|              :           2005-07-20 modify                             |*/
/*[]------------------------------------- Copyright(C) 2002 AMANO Corp.---[]*/
unsigned short	Menu_Slt( const unsigned char (*d_str)[31], const unsigned short (*d_tbl)[4], char cnt, char mod )
{
	ushort	msg;
	char	i;
	short	wk;

	/* 項目数が６より多いときは、F3に"→"を追加する */
	if (cnt > 6) {
		Fun_Dsp( FUNMSG[5] );		/* "　▲　　▼　　→　 読出  終了 " */
// MH810100(S) Y.Yamauchi 2019/12/16 車番チケットレス(メンテナンス)
	}else if( cnt == 1 ){
		Fun_Dsp( FUNMSG[38] );		/* "                   読出  終了 " */
// MH810100(E) Y.Yamauchi 2019/12/16 車番チケットレス(メンテナンス)
	}else {
		Fun_Dsp( FUNMSG[25] );		/* "　▲　　▼　　　　 読出  終了 " */
	}

	for (i = 0; i < 6; i++ ){
		if (DP_CP[0]+i >= cnt)
			break;
		/* メニュー項目表示 */
		grachr((ushort)(i+1), 0, 30, 0, COLOR_BLACK, LCD_BLINK_OFF, d_str[d_tbl[i+DP_CP[0]][2]]);
	}
	/* 選択項目反転 */
	grachr((ushort)(DP_CP[1]-DP_CP[0]+1), d_tbl[DP_CP[1]][0], d_tbl[DP_CP[1]][1], 1, COLOR_BLACK, LCD_BLINK_OFF, &d_str[d_tbl[DP_CP[1]][2]][d_tbl[DP_CP[1]][0]]);

	wk = 0;
	for( ;; ){
// MH810100(S) S.Nishimoto 2020/08/25 車番チケットレス(#4750 共通パラメータの設定変更後にドア閉をしてもメンテナンス画面のまま)
		if (CP_MODECHG) {
			// すでにドア閉(設定モード終了)の場合は、モード変更を返却する
			BUZPI();
			return MOD_CHG;
		}
// MH810100(E) S.Nishimoto 2020/08/25 車番チケットレス(#4750 共通パラメータの設定変更後にドア閉をしてもメンテナンス画面のまま)

		msg = StoF( GetMessage(), 1 );
		switch (KEY_TEN0to9(msg)) {
	/* mode change */
// MH810100(S) Y.Yamauchi 2019/12/16 車番チケットレス(メンテナンス)
			case LCD_DISCONNECT:
				return MOD_CUT;
// MH810100(E) Y.Yamauchi 2019/12/16 車番チケットレス(メンテナンス)
			case KEY_MODECHG:
			BUZPI();
			return MOD_CHG;
	/* number key */
		case KEY_TEN:
			if (cnt < 10){
				if (( msg >= KEY_TEN1 ) && ( msg <= ( cnt + KEY_TEN0 ))) {
					BUZPI();
					wk = (short)( msg - KEY_TEN0 );
				}
			}
			else {
				BUZPI();
				if(cnt < (wk * 10 + msg - KEY_TEN0)){
					wk = 0;
				}
				wk = (short)((wk*10 +  msg-KEY_TEN0) % 100);
			}
			/* 有効範囲外または、カーソル移動無し */
			if ((wk < 1) || (wk > cnt) || (DP_CP[1] == wk-1))
				continue;
			DP_CP[1] = (char)(wk - 1);
			DP_CP[0] = (char)(DP_CP[1] / 6 * 6);
			break;
	/* F1:▲ */
		case KEY_TEN_F1:
// MH810100(S) Y.Yamauchi 2019/12/16 車番チケットレス(メンテナンス)
			// 項目が1つの場合は無視
			if( cnt <= 1 ){
				continue;
			}
// MH810100(E) Y.Yamauchi 2019/12/16 車番チケットレス(メンテナンス)
			BUZPI();
			if (DP_CP[1] <= 0) {
				DP_CP[1] = (char)(cnt - 1);
				DP_CP[0] = (char)(DP_CP[1] / 6 * 6);
			}
			else {
				DP_CP[1]--;
				if (DP_CP[1] < DP_CP[0]) {
					DP_CP[0] -= 6;
				}
			}
			wk = 0;
			break;
	/* F2:▼ */
		case KEY_TEN_F2:
// MH810100(S) Y.Yamauchi 2019/12/16 車番チケットレス(メンテナンス)
			// 項目が1つの場合は無視
			if( cnt <= 1 ){
				continue;
			}
// MH810100(E) Y.Yamauchi 2019/12/16 車番チケットレス(メンテナンス)
			BUZPI();
			if (DP_CP[1] >= cnt-1) {
				DP_CP[1] = DP_CP[0] = 0;
			}
			else {
				DP_CP[1]++;
				if (DP_CP[1] >= DP_CP[0]+6) {
					DP_CP[0] += 6;
				}
			}
			wk = 0;
			break;
	/* F3:→ */
		case KEY_TEN_F3:
			/* 項目数が６以下の場合はF3を処理しない */
			if (cnt <= 6)
				continue;
			BUZPI();
			if ((DP_CP[0]+6) >= cnt) {
				DP_CP[0] = 0;
			}
			else {
				DP_CP[0] += 6;
			}
			DP_CP[1] = DP_CP[0];
			break;
	/* F4:読出 */
		case KEY_TEN_F4:
			BUZPI();
			return d_tbl[DP_CP[1]][3];
	/* F5:終了 */
		case KEY_TEN_F5:
			BUZPI();
			return MOD_EXT;

		default:
			continue;
		}

		for (i = 0; i < 6; i++ ){
			if (DP_CP[0]+i >= cnt)
				break;
			/* メニュー項目表示 */
			grachr((ushort)(i+1), 0, 30, 0, COLOR_BLACK, LCD_BLINK_OFF, d_str[d_tbl[i+DP_CP[0]][2]]);
		}
		for ( ; i < 6; i++) {
			grachr((ushort)(i+1), 0, 30, 0, COLOR_BLACK, LCD_BLINK_OFF, UMSTR3[16]);		/* 行クリア */
		}
		/* 選択項目反転 */
		grachr((ushort)(DP_CP[1]-DP_CP[0]+1), d_tbl[DP_CP[1]][0], d_tbl[DP_CP[1]][1], 1, COLOR_BLACK, LCD_BLINK_OFF, &d_str[d_tbl[DP_CP[1]][2]][d_tbl[DP_CP[1]][0]]);
	}
}

/*[]----------------------------------------------------------------------[]*/
/*| Page control                                                           |*/
/*[]----------------------------------------------------------------------[]*/
/*| MODULE NAME  : pag_ctl( void )                                         |*/
/*| PARAMETER    : void                                                    |*/
/*| RETURN VALUE : void                                                    |*/
/*[]----------------------------------------------------------------------[]*/
/*| Update       :                                                         |*/
/*[]------------------------------------- Copyright(C) 2001 AMANO Corp.---[]*/

char	pag_ctl( unsigned short ind, unsigned short pos, unsigned short *top )
{
	unsigned short	topb;
	char ret;
	ret	= 0;
	topb = *top;

	if( pos > ind - 1 )
		pos = ind;
	*top = pos - pos % 5;

	ret = ( (unsigned short)((topb != *top) ) ? 1 : 0);
	return ret;

}

