//[]----------------------------------------------------------------------[]
///	@author			2004 AMANO Corp.
///	@brief			紛失券処理
///	@date			2004/07/25
///	@file			et48.c
///	@version		MH644410
//[]------------------------------------- Copyright(C) 2004 AMANO Corp.---[]
/**********************************************************************************************************************/
/*　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　*/
/*　関数名称　　　　　：紛失券処理　　　　　　　　　記述　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　*/
/*　　　　　　　　　　　　　　　　　　　　　　　　：--------------------------------------------------------------：　*/
/*　関数シンボル　　　：et48()　　　　　　　　　　：　設定による料金の取りかたを参照し、新たに料金計算を行う。　　：　*/
/*　コンパイラ　　　　：ＭＳ－Ｃ　Ｖｅｒ　6.0   　：　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　：　*/
/*　ターゲットＣＰＵ　：Ｖ２５　　　　　　　　　　：　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　：　*/
/*　　　　　　　　　　　　　　　　　　　　　　　　：--------------------------------------------------------------：　*/
/*　　　　　　　　　　：多造 (97-02-13) 　　　　　：・指定時刻から料金を取る場合最初０円になってしまう。(MH291305)：　*/
/**********************************************************************************************************************/
																		/**********************************************/
#include	<string.h>													/*　　　　　　　　　　　　　　　　　　　　　　*/
#include	"system.h"													/*　　　　　　　　　　　　　　　　　　　　　　*/
#include	"mem_def.h"													/*　　　　　　　　　　　　　　　　　　　　　　*/
#include	"rkn_def.h"													/*　全デファイン統括　　　　　　　　　　　　　*/
#include	"rkn_cal.h"													/*　料金関連データ　　　　　　　　　　　　　　*/
#include	"rkn_fun.h"													/*　全サブルーチン宣言　　　　　　　　　　　　*/
#include	"Tbl_rkn.h"
#include	"prm_tbl.h"
#include	"ope_def.h"

//[]----------------------------------------------------------------------[]
///	@brief			紛失券処理
//[]----------------------------------------------------------------------[]
///	@return			void
///	@author			
///	@note			None
///	@attention		None
//[]----------------------------------------------------------------------[]
///	@date			Create	:	<br>
///					Update	:	
//[]------------------------------------- Copyright(C) 2005 AMANO Corp.---[]
void	et48()
{
	struct	REQ_RKN		*req_p;											// 現在計算後格納エリア

/**********************************************************************************************************************/

	req_p 		= &req_rhs[tb_number];									// 現在料金計算要求ポインター
	memmove( req_p, &req_rkn, sizeof(req_rkn) );						// 現在料金計算要求TBLを計算結果TBLへセット

	svcd_dat 	= 0;													// サービス券データ

	// 遠隔精算？
	if( OPECTL.CalStartTrigger == (uchar)CAL_TRIGGER_REMOTECALC_FEE ){
		ryoukin = g_PipCtrl.stRemoteFee.Price;						// 駐車料金
		memcpy( &org_ot, &car_ot, 7 );								// 出庫時刻を基本出庫時刻（大元）
		fun_kti = ON;												// 紛失料金は固定料金ｆｌｇ
		ryo_buf.fumei_fg = 2;										// 不明フラグ=入車時刻不明(現状未参照)
		ryo_buf.fumei_reason = fumei_LOST;							// 不明詳細理由:紛失精算
	}

	base_ryo 	= ryoukin;												// 駐車料金（基本型）のセット
	ryo_buf_n.ryo = ryoukin;											// 駐車料金のセット
	cons_tax 	= 0;													// 消費税＝０

	// 消費税率が０％ではない？
	if( cons_tax_ratio != 0 ){
		ryo_buf_n.tax = ec68( ryoukin,cons_tax_ratio );					// 消費税額
	}

	switch( ctyp_flg )
	{
		case 1:															/*　税方式が内税方式　　　　　　　　　　　　　*/
				syu_tax  = ryo_buf_n.tax;									/*　  集計用税額に消費税のｾｯﾄ 				  */
				break;													/*　　　　　　　　　　　　　　　　　　　　　　*/
		case 4:															/*　割引対象額が課税後　　　　　　　　　　　　*/
				syu_tax  = ryo_buf_n.tax;								/*　集計用税額に消費税のセット　　　　　　　　*/
				break;													/*　　　　　　　　　　　　　　　　　　　　　　*/
		default:														/*　通常外税　　　　　　　　　　　　　　　　　*/
				cons_tax = ryo_buf_n.tax;									/*　消費税＝駐車料金消費税　　　　　　　　　　*/
				break;													/*　　　　　　　　　　　　　　　　　　　　　　*/
	}

	req_p->data[2] = cons_tax;											/*　消費税金をセット　　　　　　　　　　　　　*/
	req_p->data[3] = ryoukin;											/*　駐車料金（税別）をセット　　　　　　　　　*/

	return;
}																		/**********************************************/
