/*==========================================================================*/
/* このｴﾘｱは電源OFF/ONで0に初期化される。									*/
/* 　料金ﾊﾟﾗﾒｰﾀ(ACOPSのryo_buf)は初期化されないので精算中でも問題無し		*/
/*==========================================================================*/
#include	"system.h"								/*						*/
#include	"mem_def.h"								/*						*/
#include	"rkn_def.h"								/* 全ﾃﾞﾌｧｲﾝ統括			*/
#include	"rkn_cal.h"								/* 料金関連ﾃﾞｰﾀ			*/
#include	"rkn_fun.h"								/* 全ｻﾌﾞﾙｰﾁﾝ宣言		*/
#include	"Tbl_rkn.h"								/*						*/
													/*						*/
struct	RYO_BUF_N		ryo_buf_n;					/* 料金ﾃﾞｰﾀ域			*/
/*==========================================================================*/
struct	REQ_RKN			req_rhs[150];				/* 現在計算後格納域		*/
/*--------------------------------------------------------------------------*/
char	rhspnt;										/* 現在格納数			*/
long	cons_tax;									/* 消費税額				*/
long	syu_tax;									/* 集計用消費税金額		*/
/*==========================================================================*/
struct	TSN_TKI			tsn_tki;					/* 定期ﾃﾞｰﾀ				*/
struct	VL_TIK			vl_tik;						/* 駐車券ﾃﾞｰﾀ			*/
struct	VL_KAS			vl_kas;						/* 回数券ﾃﾞｰﾀ			*/
/*==========================================================================*/
char	prk_kind;									/* 基本/拡張(1/2)		*/
char	cr_tkpk_flg;								/* 定期/駐車券ﾌﾗｸﾞ(1:定 2:駐)*/
char	tki_pk_use;									/* 定期/駐車券使用(1:定 2:駐 3:両方)*/
/*==========================================================================*/
short	ps_tm[9][TKI_MAX];							/* 定期時間				*/
/*==========================================================================*/
char	tkcyu_ichi;									/* 定期中止ﾃﾞｰﾀ読取位置	*/
char	fun_kti;									/* 紛失固定料金ﾌﾗｸﾞ		*/
													/*						*/
