/*[]--------------------------------------------------------------------------------------------------[]*/
/*| ì¡ï ì˙É`ÉFÉbÉN																					   |*/
/*[]--------------------------------------------------------------------------------------------------[]*/
/*| MODULE NAME	: tokubet( p_m, p_d )																   |*/
/*| PARAMETER	: p_y	: îN																		   |*/
/*| 			: p_m	: åé																		   |*/
/*| 			: p_d	: ì˙																		   |*/
/*| RETURN VALUE: cm_ret: 0 = í èÌ																	   |*/
/*| 			: 		: 1 = ì¡ï ì˙																   |*/
/*[]--------------------------------------------------------------------------------------------------[]*/
/*| Author		: R.Hara(AMANO)																		   |*/
/*| Date		: 2001-11-15																		   |*/
/*| Update		:																					   |*/
/*[]----------------------------------------------------------------- Copyright(C) 2001 AMANO Corp.---[]*/
																		/*								*/
#include	"system.h"													/*								*/
#include	"mem_def.h"													/*								*/
#include	"pri_def.h"													/*								*/
#include	"rkn_def.h"													/*								*/
#include	"rkn_cal.h"													/*								*/
#include	"ope_def.h"													/*								*/
#include	"prm_tbl.h"													/*								*/
																		/*								*/
/*--------------------------*/
/* ì¡ï ì˙31ì˙+ì¡ï ä˙ä‘3ä˙ä‘	*/
/*--------------------------*/
/*--------------------------------------------------------------*/
/*	ètï™ÇÃì˙√∞ÃﬁŸÅiÇPÇXÇWÇOîNÅ`ÇQÇOÇVÇXîNÅj						*/
/*--------------------------------------------------------------*/
const	uchar	Shunbun_Day[100] =
{
	20,21,21,21,20,21,21,21,20,21,		// ÇPÇXÇWÇOîNÅ`ÇPÇXÇWÇXîN
	21,21,20,20,21,21,20,20,21,21,		// ÇPÇXÇXÇOîNÅ`ÇPÇXÇXÇXîN
	20,20,21,21,20,20,21,21,20,20,		// ÇQÇOÇOÇOîNÅ`ÇQÇOÇOÇXîN
	21,21,20,20,21,21,20,20,21,21,		// ÇQÇOÇPÇOîNÅ`ÇQÇOÇPÇXîN
	20,20,21,21,20,20,20,21,20,20,		// ÇQÇOÇQÇOîNÅ`ÇQÇOÇQÇXîN
	20,21,20,20,20,21,20,20,20,21,		// ÇQÇOÇRÇOîNÅ`ÇQÇOÇRÇXîN
	20,20,20,21,20,20,20,21,20,20,		// ÇQÇOÇSÇOîNÅ`ÇQÇOÇSÇXîN
	20,21,20,20,20,21,20,20,20,20,		// ÇQÇOÇTÇOîNÅ`ÇQÇOÇTÇXîN
	20,20,20,20,20,20,20,20,20,20,		// ÇQÇOÇUÇOîNÅ`ÇQÇOÇUÇXîN
	20,20,20,20,20,20,20,20,20,20		// ÇQÇOÇVÇOîNÅ`ÇQÇOÇVÇXîN
};

/*--------------------------------------------------------------*/
/*	èHï™ÇÃì˙√∞ÃﬁŸÅiÇPÇXÇWÇOîNÅ`ÇQÇOÇVÇXîNÅj						*/
/*--------------------------------------------------------------*/
const	uchar	Shuubun_Day[100] =
{
	23,23,23,23,23,23,23,23,23,23,		// ÇPÇXÇWÇOîNÅ`ÇPÇXÇWÇXîN
	23,23,23,23,23,23,23,23,23,23,		// ÇPÇXÇXÇOîNÅ`ÇPÇXÇXÇXîN
	23,23,23,23,23,23,23,23,23,23,		// ÇQÇOÇOÇOîNÅ`ÇQÇOÇOÇXîN
	23,23,22,23,23,23,22,23,23,23,		// ÇQÇOÇPÇOîNÅ`ÇQÇOÇPÇXîN
	22,23,23,23,22,23,23,23,22,23,		// ÇQÇOÇQÇOîNÅ`ÇQÇOÇQÇXîN
	23,23,22,23,23,23,22,23,23,23,		// ÇQÇOÇRÇOîNÅ`ÇQÇOÇRÇXîN
	22,23,23,23,22,22,23,23,22,22,		// ÇQÇOÇSÇOîNÅ`ÇQÇOÇSÇXîN
	23,23,22,22,23,23,22,22,23,23,		// ÇQÇOÇTÇOîNÅ`ÇQÇOÇTÇXîN
	22,22,23,23,22,22,23,23,22,22,		// ÇQÇOÇUÇOîNÅ`ÇQÇOÇUÇXîN
	23,23,22,22,23,23,22,22,22,23		// ÇQÇOÇVÇOîNÅ`ÇQÇOÇVÇXîN
};

const	uchar MAY_6[100]={											/* ÇTåéÇUì˙Çãxì˙ÅiêUë÷ãxì˙Åj	*/
																	/* Ç∆Ç∑ÇÈÅBÅiê›íËÇ…ÇÊÇËëIëÅj	*/
																	/* 1ÇÃÇ∆Ç´ãxì˙àµÇ¢				*/
/*			0-1-2-3-4  5-6-7-8-9  */								/* 								*/
			0,0,0,0,0, 0,0,0,1,1,									/*	ÇOÇOîNÅ`ÇOÇXîN				*/
			0,0,0,1,1, 1,0,0,0,1,									/*	ÇPÇOîNÅ`ÇPÇXîN				*/
			1,0,0,0,1, 1,1,0,0,0,									/*	ÇQÇOîNÅ`ÇQÇXîN				*/
			1,1,0,0,0, 0,1,1,0,0,									/*	ÇRÇOîNÅ`ÇRÇXîN				*/
			0,1,1,1,0, 0,0,1,1,0,									/*	ÇSÇOîNÅ`ÇSÇXîN				*/
			0,0,1,1,1, 0,0,0,1,1,									/*	ÇTÇOîNÅ`ÇTÇXîN				*/
			0,0,0,0,1, 1,0,0,0,1,									/*	ÇUÇOîNÅ`ÇUÇXîN				*/
			1,1,0,0,0, 1,1,0,0,0,									/*	ÇVÇOîNÅ`ÇVÇXîN				*/
			0,0,0,0,0, 0,0,0,0,0,									/*								*/
			0,0,0,0,0, 0,0,0,0,0,									/*								*/
};																	/*								*/

char	tokubet( short p_y, short p_m, short p_d )						/*								*/
{																		/*								*/
	char	lopcnt;														/* Ÿ∞Ãﬂ∂≥›¿						*/
	short	week;														/*								*/
	ushort	noml;														/*								*/
	short	bp_y, bp_m, bp_d;											/*								*/
	// ètï™ÇÃì˙Å^èHï™ÇÃì˙ëŒâû
	uchar	SpDay_Mon;													/* ì¡ï ì˙ÅiåéÅj					*/
	uchar	SpDay_Day;													/* ì¡ï ì˙Åiì˙Åj					*/
	uchar	SpDay_Sht;													/* ì¡ï ì˙ÅiºÃƒóLñ≥Åj			*/
																		/*								*/
/********************************************************************************************************/
																		/*								*/
	for( lopcnt = 0 ; lopcnt < SP_RANGE_MAX; lopcnt++ )					/* ìoò^¥ÿ±Ÿ∞Ãﬂ					*/
	{																	/*								*/
		if ( SP_RANGE[lopcnt][0] == 0 ) continue;						/* ê›íËÇ»Çµ						*/
		if ( SP_RANGE[lopcnt][1] == 0 ) continue;						/* ê›íËÇ»Çµ						*/
		if ( SP_RANGE[lopcnt][2] == 0 ) continue;						/* ê›íËÇ»Çµ						*/
		if ( SP_RANGE[lopcnt][3] == 0 ) continue;						/* ê›íËÇ»Çµ						*/
																		/*								*/
		if (( SP_RANGE[lopcnt][0] < SP_RANGE[lopcnt][2] ) ||			/* äJénì˙ÅÖèIóπì˙(ó·: 5/1Å`5/18)*/
			(( SP_RANGE[lopcnt][0] == SP_RANGE[lopcnt][2] ) &&			/*								*/
			 ( SP_RANGE[lopcnt][1] <= SP_RANGE[lopcnt][3] )))			/*								*/
		{																/*								*/
			if((( SP_RANGE[lopcnt][0] < p_m ) ||						/*								*/
				(( SP_RANGE[lopcnt][0] == p_m ) &&						/*								*/
				 ( SP_RANGE[lopcnt][1] <= p_d ))) &&					/*								*/
			   (( p_m < SP_RANGE[lopcnt][2] ) ||						/*								*/
				(( p_m == SP_RANGE[lopcnt][2] ) &&						/*								*/
				 ( p_d <= SP_RANGE[lopcnt][3] ))))						/*								*/
			{															/*								*/
				return( (char)(2+lopcnt) );								/*								*/
			}															/*								*/
		}																/*								*/
		else															/* äJénì˙ÅÑèIóπì˙(ó·:12/28Å`1/5)*/
		{																/*								*/
			if (( SP_RANGE[lopcnt][0] < p_m ) ||						/*								*/
				(( SP_RANGE[lopcnt][0] == p_m ) &&						/*								*/
				 ( SP_RANGE[lopcnt][1] <= p_d )) ||						/*								*/
				( p_m < SP_RANGE[lopcnt][2] ) ||						/*								*/
				(( p_m == SP_RANGE[lopcnt][2] ) &&						/*								*/
				 ( p_d <= SP_RANGE[lopcnt][3] )))						/*								*/
			{															/*								*/
				return( (char)(2+lopcnt) );								/*								*/
			}															/*								*/
		}																/*								*/
	}																	/*								*/
																		/*								*/
	week = youbiget( p_y, p_m, p_d );									/* ójì˙éZèo						*/
	noml = dnrmlzm( p_y, p_m, p_d );									/*								*/
	noml--;																/* 1ì˙ñﬂÇ∑						*/
	idnrmlzm( noml, &bp_y, &bp_m, &bp_d );								/*								*/
																		/*								*/
																		/*								*/
	for( lopcnt = 0 ; lopcnt < SP_DAY_MAX; lopcnt++ )					/* ìoò^¥ÿ±Ÿ∞Ãﬂ					*/
	{																	/*								*/
		SpDay_Mon = SP_DAY[lopcnt][0];									/* ì¡ï ì˙ÅiåéÅjÿ∞ƒﬁ				*/
		SpDay_Day = SP_DAY[lopcnt][1];									/* ì¡ï ì˙Åiì˙Åjÿ∞ƒﬁ				*/
		SpDay_Sht = SP_DAY[lopcnt][2];									/* ì¡ï ì˙ÅiºÃƒóLñ≥Åjÿ∞ƒﬁ		*/
																		/*								*/
		if( (p_y >= 1980) && (p_y <= 2079) ){							/* ètï™ÅEèHï™ëŒâûîN(1980Å`2079)?*/
			/* ètï™ÇÃì˙ÅAèHï™ÇÃì˙îªíË */								/*								*/
			if((SpDay_Mon==3)&&(SpDay_Day==20)&&(SpDay_Sht!=0)){		/* ètï™ÇÃì˙ê›íË(3/20ºÃƒóL)ÅH	*/
				SpDay_Day = Shunbun_Day[p_y-1980];						/* YesÅF ﬂ◊“∞¿Ç≈ó^Ç¶ÇÁÇÍÇΩîNÇÃ	*/
			}															/*		ètï™ÇÃì˙Çÿ∞ƒﬁÇ∑ÇÈ		*/
			else if((SpDay_Mon==9)&&(SpDay_Day==23)&&(SpDay_Sht!=0)){	/* èHï™ÇÃì˙ê›íË(9/23ºÃƒóL)ÅH	*/
				SpDay_Day = Shuubun_Day[p_y-1980];						/* YesÅF ﬂ◊“∞¿Ç≈ó^Ç¶ÇÁÇÍÇΩîNÇÃ	*/
			}															/*		èHï™ÇÃì˙Çÿ∞ƒﬁÇ∑ÇÈ		*/
		}																/*								*/
																		/*								*/
		if(( (char)p_m == SpDay_Mon )&&									/*								*/
		   ( (char)p_d == SpDay_Day ))									/* åéÇ©Ç¬ì˙Ç™ìØÇ∂?				*/
		{																/*								*/
			if(( week == 0 )&&											/* ì¡ï ì˙Ç™ì˙ójì˙?				*/
			   ( SpDay_Sht ))											/* ºÃƒÇ∑ÇÈê›íË?					*/
			{															/*								*/
				/* í èÌÇÃì˙ójì˙àµÇ¢Ç∆Ç∑ÇÈ */							/*								*/
			}															/*								*/
			else														/*								*/
			{															/*								*/
				return( 1 );											/* ì¡ï ì˙Ç∆Ç∑ÇÈ					*/
			}															/*								*/
		}																/*								*/
		else															/*								*/
		{																/*								*/
			if(( week == 1 )&&											/* åéójì˙?						*/
			   ( SpDay_Sht ))											/* ºÃƒÇ∑ÇÈê›íË?					*/
			{															/*								*/
				if(( (char)bp_m == SpDay_Mon )&&						/*								*/
				   ( (char)bp_d == SpDay_Day ))							/* 1ì˙ëOÇÃåéÇ©Ç¬ì˙Ç™ìØÇ∂?		*/
				{														/*								*/
					return( 1 );										/* ì¡ï ì˙Ç∆Ç∑ÇÈ					*/
				}														/*								*/
			}															/*								*/
		}																/*								*/
	}																	/*								*/
																		/*								*/
	if((prm_get( 0,S_TOK,(short)(41),1,1 )) == 0 ){						/*								*/
																		/*								*/
		/** ÉnÉbÉsÅ[É}ÉìÉfÅ[ **/
		if( week == 1 ){												/* åéójì˙?						*/
			for( lopcnt = 0 ; lopcnt < SP_HAPPY_MAX; lopcnt++ ){		/*  ØÀﬂ∞œ›√ﬁ∞ê›íËêîï™Ÿ∞Ãﬂ		*/
				if( (char)p_m == SP_HAPPY[lopcnt][0] ){					/* åéÇ™ìØÇ∂						*/
					noml = ((p_d-1) / 7) + 1;							/* âΩâÒñ⁄ÇÃxójì˙Ç©get			*/
					if( SP_HAPPY[lopcnt][1] == noml ){					/* âΩèTñ⁄Ç©Ç™ê›íËÇ∆ìØÇ∂			*/
						return( 1 );									/* ì¡ï ì˙Ç…éwíË					*/
					}
				}														/*								*/
			}															/*								*/
		}																/*								*/
	}else if((prm_get( 0,S_TOK,(short)(41),1,1 )) == 1 ){				//
		for( lopcnt = 0 ; lopcnt < SP_WEEK_MAX; lopcnt++ ){				//
			if( ((char)p_m == SP_WEEK[lopcnt][0]) || (SP_WEEK[lopcnt][0] == 99) ){	// åé
				noml = ((p_d-1) / 7) + 1;											// âΩâÒñ⁄ÇÃxójì˙Ç©get
				if( (SP_WEEK[lopcnt][1] == noml) || (SP_WEEK[lopcnt][1] == 9) ){	//âÒêî
					if( SP_WEEK[lopcnt][2] == week ){								//ójì˙
					return( 1 );										//
					}
				}														//
			}															//
		}																//
	}																	//

	/*--------------------------------------------------------------*/	/*								*/
	/*	ì¡ï îNåéì˙													*/	/*								*/
	/*--------------------------------------------------------------*/	/*								*/
	for( lopcnt = 0 ; lopcnt < SP_YAER_MAX; lopcnt++ ){					/* ì¡ï îNåéì˙					*/
																		/*								*/
		if(( p_y % 100) == SP_YEAR[lopcnt][0] ){						/* îNàÍív?(Y)					*/
			if(( p_m == SP_YEAR[lopcnt][1] )&&( p_d == SP_YEAR[lopcnt][2] )){	/* åéì˙àÍív?(Y)			*/
																		/*								*/
				return( 1 );											/* ì¡ï ì˙Ç…éwíË					*/
			}															/*								*/
		}																/*								*/
	}																	/*								*/
																		/*								*/
	/*--------------------------------------------------------------*/	/*								*/
	/*	ÇTåéÇUì˙Çãxì˙Ç∆Ç∑ÇÈÅ^ÇµÇ»Ç¢								*/	/*								*/
	/*--------------------------------------------------------------*/	/*								*/
																		/*								*/
	if( CPrmSS[S_TOK][49] == 0){										/* 5åé6ì˙Ç™êUë÷ãxì˙ÇÃèÍçá		*/
																		/* ãxì˙Åiì¡ï ì˙ÅjÇ∆Ç∑ÇÈ?(Y)		*/
																		/*								*/
		if(( p_m == 5 )&&( p_d == 6 )){									/* ÇTåéÇUì˙?(Y)					*/
			lopcnt = MAY_6[ p_y % 100 ];								/* å≈íËÉeÅ[ÉuÉãéQè∆				*/
																		/*								*/
			if(	lopcnt == 1 ){											/* ãxì˙?(Y)						*/
				return( 1 );											/* ì¡ï ì˙Ç…éwíË					*/
			}															/*								*/
		}																/*								*/
	}																	/*								*/
	return( 0 );														/* åãâ Çï‘Ç∑					*/
}																		/*								*/
																		/*------------------------------*/
